[
  {
    "id": "english_sec_2",
    "language": "english",
    "granularity": "section",
    "section": "2",
    "text": "section 2 of the Dowry Prohibition Act, 1961 (28 of 1961). \n(2) Whoever commits dowry death shall be punished with imprisonment for a term which shall not be \nless than seven years but which may extend to imprisonment for life.] \n305. Abetment of suicide of child or insane person .—If any person under eighteen years of age, \nany insane person, any delirious person, any idiot, or any person in a state of intoxication, commits  \n                                                           \n1. Ins. by Act 27 of 1870, s. 12. \n2. Ins. by Act 43 of 1986, s. 10 (w.e.f. 19-11-1986). \n76 \n \nsuicide, whoever abets the commission of such suicide, shall be punished with death or 1[imprisonment \nfor life], or imprisonment for a term not exceeding ten years, and shall also be liable to fine. \n306. Abetment of suicide .—If any person commits suicide, whoever abets the commission of such \nsuicide, shall be punished with imprisonment of either description for a term  which may extend to ten \nyears, and shall also be liable to fine. \n307. Attempt to murder.—Whoever does any act with such intention or knowledge, and under such \ncircumstances that, if he by that act caused death, he would be guilty of murder, shal l be punished with \nimprisonment of either description for a term which may extend to ten years, and sha ll also be liable to \nfine; and if hurt is caused to any person by such act, the offender shall be liab le either to 1[imprisonment \nfor life], or to such punishment as is hereinbefore mentioned. \nAttempts by life-convicts .—2[When any person offending under this section is under sentence of \n1[imprisonment for life], he may, if hurt is caused, be punished with death.] \nIllustrations \n(a) A shoots at Z with intention to kill him, under such circumstances that, if death ensued, A would be guilty of murder. A \nis liable to punishment under this section. \n(b) A, with the intention of causing the death of a child of tend er years, exposes it in a desert place. A has committed the \noffence defined by this section, though the death of the child does not ensue. \n(c) A, intending to murder Z, buys a gun and loads it. A has not yet c ommitted the offence. A fires the gun at Z. He has \ncommitted the offence defined in this section, and, if by such firi ng he wounds Z, he is liable to the punishment provided by the \nlatter part of  3[the first paragraph of] this section. \n(d) A, intending to murder Z by poison, purchases poison and mixes the  same with food which remains in A's keeping; A \nhas not yet committed the offence defined in this section. A places the food on Z's table or delivers it to Z's servants to place it on \nZ's table. A has committed the offence defined in this section. \n 308. Attempt to commit culpable homicide .—Whoever does any act with such intention or \nknowledge and under such circumstances that, if he by that act caused death, he would be guilt y of \nculpable homicide not amounting to murder, shall be punished with imprisonment of eit her description \nfor a term which may extend to three years, or with fine, or with both; and, if  hurt is caused to any person \nby such act, shall be punished with imprisonment of either description for a term which m ay extend to \nseven years, or with fine, or with both. \nIllustration \nA, on grave and sudden provocation, fires a pistol at Z, unde r such circumstances that if he thereby caused death he would \nbe guilty of culpable homicide not amounting to murder. A has committed the offence defined in this section. \n309. Attempt to commit suicide .—Whoever attempts to commit suicide and does any act towards \nthe commission of such offence, shall be punished with simple imprisonment for a t erm which may \nextend to one year 4[or with fine, or with both.] \n310. Thug.—Whoever, at any time after the passing of this Act, shall have been habitually associated \nwith any other or others for the purpose of committing robbery or child-steal ing by means of or \naccompanied with murder, is a thug. \n311. Punishment.—Whoever is a thug, shall be punished with 1[imprisonment for life], and shall also \nbe liable to fine. \nOf the causing of miscarriage, of injuries to unborn children, of the exposure  \nof infants, and of the concealment of births. \n312. Causing miscarraige .—Whoever voluntarily causes a woman with child to miscarry, shall, if \nsuch miscarriage be not caused in good faith for the purpose of saving the life of the woman, be punished \nwith imprisonment of either description for a term which may extend to three y ears, or with fine, or with \nboth; and, if the woman be quick with child, shall be punished with imprisonment of either description for \na term which may extend to seven years, and shall also be liable to fine. \n  \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. Ins. by Act 24 of 1870, s. 11. \n3. Ins. by Act 12 of 1891, s. 2 and the Second Sch. \n4. Subs. by Act 8 of 1882, s. 7, for “and shall also be liable to fine”. \n77 \n \nExplanation.—A woman who causes herself to miscarry, is within the meaning of this section.  \n313. Causing miscarriage without woman's consent .—Whoever commits the offence defined in \nthe last preceding section without the consent of the woman, whether the woman is  quick with child o r \nnot, shall be punished with 1[imprisonment for life], or with imprisonment of either description for a term \nwhich may extend to ten years, and shall also be liable to fine.  \n314. Death caused by act done with intent to cause miscarriage .—Whoever, with intent to cause \nthe miscarriage of a woman with child, does any act which causes the death of such woman, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine; \nif act done without woman's consent .—and if the act is done without the consent of the woman, \nshall be punished either with 1[imprisonment for life], or with the punishment above mentioned. \nExplanation.—It is not essential to this offence that the offender should know that the  act is likely to \ncause death. \n315. Act done with intent to prevent child being born alive or to cause it to die after birth.—\nWhoever before the birth of any child does any act with the intention of thereby pr eventing that child \nfrom being born alive or causing it to die after its birth, and does by such act prevent that child from being \nborn alive, or causes it to die after its birth, shall, if such act be not caused in good faith for the purpose of \nsaving the life of the mother, be punished with imprisonment of either descript ion for a term which may \nextend to ten years, or with fine, or with both. \n316. Causing death of quick unborn child by act amounting to culpable homicide .—Whoever \ndoes any act under such circumstances, that if he thereby caused death he would be guilty of culpable \nhomicide, and does by such act cause the death of a quick unborn child, shall be punished wit h \nimprisonment of either description for a term which may extend to ten years, and shall also be liable to \nfine. \nIllustration \nA, knowing that he is likely to cause the death of a pregnant w oman, does an act which, if it caused the death of the woman,  \nwould amount to culpable homicide. The woman is injured, but does n ot die; but the death of an unborn quick child with which \nshe is pregnant is thereby caused. A is guilty of the offence defined in this section. \n317. Exposure and abandonment of child under twelve years, by parent or person having care \nof it.—Whoever being the father or mother of a child under the age of twelve years, or hav ing the care of \nsuch child, shall expose or leave such child in any place with the intention of wholly abandoning such \nchild, shall be punished with imprisonment of either description for a term which m ay extend to seven \nyears, or with fine, or with both. \nExplanation.—This section is not intended to prevent the trial of the offender for murder or  culpable \nhomicide, as the case may be, if the child die in consequence of the exposure. \n318. Concealment of birth by secret disposal of dead body .—Whoever, by secretly burying or \notherwise disposing of the dead body of a child whether such child die before or after or during its birth, \nintentionally conceals or endeavors to conceal the birth of such child, shall be punished wit h \nimprisonment of either description for a term which may extend to two years, or with fine, or with both. \nOf Hurt \n319. Hurt.—Whoever causes bodily pain, disease or infirmity to any person is said to cause hurt. \n320. Grievous hurt.—The following kinds of hurt only are designated as “grievous”:— \nFirst.—Emasculation. \nSecondly.—Permanent privation of the sight of either eye. \nThirdly.—Permanent privation of the hearing of either ear. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n \n \n78 \n \nFourthly.—Privation of any member or joint. \nFifthly.—Destruction or permanent impairing of the powers of any member or joint. \nSixthly.—Permanent disfiguration of the head or face. \nSeventhly.—Fracture or dislocation of a bone or tooth. \nEighthly.—Any hurt which endangers life or which causes the sufferer to be during the space of \ntwenty days in severe bodily pain, or unable to follow his ordinary pursuits. \n321. Voluntarily causing hurt.—Whoever does any act with the intention of thereby causing hurt to \nany person, or with the knowledge that he is likely thereby to cause hurt to any  person, and does thereby \ncause hurt to any person, is said “voluntarily to cause hurt”.  \n322. Voluntarily causing grievous hurt .—Whoever voluntarily causes hurt, if the hurt which he \nintends to cause or knows himself to be likely to cause is grievous hurt, and if t he hurt which he causes is \ngrievous hurt, is said “voluntarily to cause grievous hurt”. \nExplanation.—A person is not said voluntarily to cause grievous hurt except when he both cause s \ngrievous hurt and intends or knows himself to be likely to cause grievous hurt. But he is said voluntarily \nto cause grievous hurt, if intending or knowing himself to be likely to caus e grievous hurt of one kind, he \nactually causes grievous hurt of another kind. \nIllustration \nA, intending of knowing himself to be likely permanently to disf igure Z's face, gives Z a blow which does not permanently \ndisfigure Z's face, but which causes Z to suffer severe bodily pain for the space of twenty days. A has voluntarily caused grievous \nhurt. \n323. Punishment for voluntarily causing hurt .—Whoever, except in the case provided for by \nsection 334, voluntarily causes hurt, shall be punished with imprisonment of either descript ion for a term \nwhich may extend to one year, or with fine which may extend to one thousand rupees, or with both. \n324. Voluntarily causing hurt by dangerous weapons or means .—Whoever, except in the case \nprovided for by section 334, voluntarily causes hurt by means of any instrument for shooti ng, stabbing or \ncutting, or any instrument which, used as a weapon of offence, is likely to cause death, or by means of fire \nor any heated substance, or by means of any poison or any corrosive substance, or by means o f any \nexplosive substance or by means of any substance which it is deleterious to the hum an body to inhale, to \nswallow, or to receive into the blood, or by means of any animal, shall be punished wi th imprisonment of \neither description for a term which may extend to three years, or with fine, or with both. \n325. Punishment for voluntarily causing grievous hurt.—Whoever, except in the case provided for \nby section 335, voluntarily causes grievous hurt, shall be punished with imprisonment of either \ndescription for a term which may extend to seven years, and shall also be liable to fine. \n326. Voluntarily causing grievous hurt by dangerous weapons or means .—Whoever, except in \nthe case provided for by section 335, voluntarily causes grievous hurt by means of any instrument for \nshooting, stabbing or cutting, or any instrument which, used as a weapon of offence, is lik ely to cause \ndeath, or by means of fire or any heated substance, or by means of any poison or any corrosive substance, \nor by means of any explosive substance, or by means of any substance which it is deleterious to the \nhuman body to inhale, to swallow, or to receive into the blood, or by means of any animal, shall be \npunished with 1[imprisonment for life], or with imprisonment of either description for a t erm which may \nextend to ten years, and shall also be liable to fine. \n2[326A. Voluntarily causing grievous hurt by use of acid, etc .—Whoever causes permanent or \npartial damage or deformity to, or burns or maims or disfigures or disables, any  part or parts of the body \nof a person or causes grievous hurt by throwing acid on or by administering acid to t hat person, or by \nusing any other means with the intention of causing or with the knowledge that h e is likely to cause such \ninjury or hurt, shall be punished with imprisonment of either description for a term which shall not be less \nthan ten years but which may extend to imprisonment for life, and with fine: \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. Ins. by Act 13 of 2013, s. 5 (w.e.f. 3-2-2013). \n79 \n \nProvided that such fine shall be just and reasonable to meet the medical expenses of the treatment of \nthe victim: \nProvided further that any fine imposed under this section shall be paid to the victim. \n326B. Voluntarily throwing or attempting to throw acid .—Whoever throws or attempts to throw \nacid on any person or attempts to administer acid to any person, or attempts to use  any other means, with \nthe intention of causing permanent or partial damage or deformity or burns or m aiming or disfigurement \nor disability or grievous hurt to that person, shall be punished with imprisonment of ei ther description for \na term which shall not be less than five years but which may extend to seven years, and shall also be \nliable to fine. \nExplanation 1. —For the purposes of section 326A and this section, \"acid\" includes any substance \nwhich has acidic or corrosive character or burning nature, that is capable of c ausing bodily injury leading \nto scars or disfigurement or temporary or permanent disability. \nExplanation 2.—For the purposes of section 326A and this section, permanent or partial damage o r \ndeformity shall not be required to be irreversible.] \n327. Voluntarily causing hurt to extort property, or to constrain to an illegal to an act .—\nWhoever voluntarily causes hurt, for the purpose of extorting from the sufferer, or fr om any person \ninterested in the sufferer, any property or valuable security, or of constraining  the sufferer or any person \ninterested in such sufferer to do anything which is illegal or which may fac ilitate the commission of an \noffence, shall be punished with imprisonment of either description for a term  which may extend to ten \nyears, and shall also be liable to fine. \n328. Causing hurt by means of poison, etc., with intent to commit and offence .—Whoever \nadministers to or causes to be taken by any person any poison or any stupefying, intoxicating or \nunwholesome drug, or other thing with intent to cause hurt to such person, or with intent to commit or to \nfacilitate the commission of an offence or knowing it to be likely that he w ill thereby cause hurt, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine.  \n329. Voluntarily causing grievous hurt to extort property, or to constrain to an illegal act .—\nWhoever voluntarily causes grievous hurt for the purpose of extorting from t he sufferer or from any \nperson interested in the sufferer any property or valuable security, or of constraining the sufferer or any \nperson interested in such sufferer to do anything that is illegal or which  may facilitate the commission of \nan offence, shall be punished with 1[imprisonment for life], or imprisonment of either description for a \nterm which may extend to ten years, and shall also be liable to fine. \n330. Voluntarily causing hurt to extort confession, or to compel restoration of propert y.—\nWhoever voluntarily causes hurt, for the purpose of extorting from the suffer er or from any person \ninterested in the sufferer, any confession or any information which may lead to the detection of an offence \nor misconduct, or for the purpose of constraining the sufferer or any person interest ed in the sufferer to \nrestore or to cause the restoration of any property or valuable security or to sat isfy any claim or demand, \nor to give information which may lead to the restoration of any property or  valuable security, shall be \npunished with imprisonment of either description for a term which may extend to seven years, and shall \nalso be liable to fine. \nIllustrations \n(a) A, a police-officer, tortures Z in order to induce Z to confess that h e committed a crime. A is guilty of an offence under \nthis section. \n(b) A, a police-officer, tortures B to induce him to point out where cert ain stolen property is deposited. A is guilty of an \noffence under this section. \n(c) A, a revenue officer, tortures Z in order to compel him to pay certain arrears of revenue due fro m Z. A is guilty of an \noffence under this section. \n(d) A, a zamindar, tortures a raiyat in order to compel him to pay his rent. A is guilty of an offence under this section. \n331. Voluntarily causing grievous hurt to extort confession, or to compel restoration of \nproperty.—Whoever voluntarily causes grievous hurt for the purpose of extorting from the suf ferer or \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n80 \n \nfrom any person interested in the sufferer any confession or any information whi ch may lead to the \ndetection of an offence or misconduct, or for the purpose of constraining the sufferer o r any person \ninterested in the sufferer to restore or to cause the restoration of any property or valuable security, or to \nsatisfy any claim or demand or to give information which may lead to the r estoration of any property or \nvaluable security, shall be punished with imprisonment of either description for a t erm which may extend \nto ten years, and shall also be liable to fine. \n332. Voluntarily causing hurt to deter public servant from his duty.—Whoever voluntarily causes \nhurt to any person being a public servant in the discharge of his duty as such public servant, or with intent \nto prevent or deter that person or any other public servant from dischargi ng his duty as such public \nservant, or in consequence of anything done or attempted to be done by that person in the lawful \ndischarge of his duty as such public servant, shall be punished with imprisonment of either description for \na term which may extend to three years, or with fine, or with both. \nSTATE AMENDMENT \nMaharashtra. \nAmendment of section 332 of 45 of 1860 .—In section 332 of the Indian Penal Code, 1860, in its \napplication to the State of Maharashtra (hereinafter, in this Chapter, refer red to as “the said Code ”), for \nthe words “three years” the words “five years” shall be substituted. \n[Vide Maharashtra Act 50 of 2018, sec. 2] \n333. Voluntarily causing grievous hurt to deter public servant from his duty .—Whoever \nvoluntarily causes grievous hurt to any person being a public servant in the discharge of his duty as such \npublic servant, or with intent to prevent or deter that person or any o ther public servant from discharging \nhis duty as such public servant, or in consequence of anything done or attempted to be done by t hat \nperson in the lawful discharge of his duty as such public servant, shall be punished wit h imprisonment of \neither description for a term which may extend to ten years, and shall also be liable to fine. \n334. Voluntarily causing hurt on provocation .—Whoever voluntarily causes hurt on grave and \nsudden provocation, if he neither intends nor knows himself to be likely to cause hurt to any person other \nthan the person who gave the provocation, shall be punished with imprisonment of either description for a \nterm which may extend to one month, or with fine which may extend to five hundred rupees, or with both. \n335. Voluntarily causing grievous hurt on provocation .—Whoever 1[voluntarily] causes grievous \nhurt on grave and sudden provocation, if he neither intends nor knows himself to be lik ely to cause \ngrievous hurt to any person other than the person who gave the provocation, shall be punished wit h \nimprisonment of either description for a term which may extend to four yea rs, or with fine which may \nextend to two thousand rupees, or with both.  \nExplanation.—The last two sections are subject to the same provisos as Exception 1, section 300. \n336. Act endangering life or personal safety of others .—Whoever does any act so rashly or \nnegligently as to endanger human life or the personal safety of others, shall be pun ished with \nimprisonment of either description for a term which may extend to three months or with fine which may \nextend to two hundred and fifty rupees, or with both. \n337. Causing hurt by act endangering life or personal safety of others .—Whoever causes hurt to \nany person by doing any act so rashly or negligently as to endanger human life, or the per sonal safety of \nothers, shall be punished with imprisonment of either description for a term which m ay extend to six \nmonths, or with fine which may extend to five hundred rupees, or with both. \n338. Causing grievous hurt by act endangering life or personal safety of others .—Whoever \ncauses grievous hurt to any person by doing any act so rashly or negligently as to endanger human life, or \nthe personal safety of others, shall be punished with imprisonment of either desc ription for a term which \nmay extend to two years, or with fine which may extend to one thousand rupees, or with both. \nOf wrongful restraint and wrongful confinement \n339. Wrongful restraint .—Whoever voluntarily obstructs any person so as to prevent that person \nfrom proceeding in any direction in which that person has a right to proceed, is said wrongfully to restrain \nthat person. \n  \n                                                           \n1. Ins. by Act 8 of 1882, s. 8. \n81 \n \nException.—The obstruction of a private way over land or water which a person in good fai th \nbelieves himself to have a lawful right to obstruct, is not an offence within the meaning of this section. \nIllustration \nA obstructs a path along which Z has a right to pass, A not believ ing in good faith that he has a right to stop the path. Z is \nthereby prevented from passing. A wrongfully restrains Z. \n340. Wrongful confinement .—Whoever wrongfully restrains any person in such a manner as to \nprevent that person from proceeding s beyond certain circumscribing limits, is said “wrongfully to \nconfine” that person. \nIllustrations \n(a) A causes Z to go within a walled space, and locks Z in Z. is thus prevented from proceeding in any direction beyond the  \ncircumscribing line of wall. A wrongfully confines Z. \n(b) A places men with firearms at the outlets of a building, and tells Z th at they will fire at Z if Z attempts to leave the \nbuilding. A wrongfully confines Z. \n341. Punishment for wrongful restraint .—Whoever wrongfully restrains any person shall be \npunished with simple imprisonment for a term which may extend to one month, or w ith fine which may \nextend to five hundred rupees, or with both. \n342. Punishment for wrongful confinement .—Whoever wrongfully confines any person shall be \npunished with imprisonment of either description for a term which may extend to one year, or with fine \nwhich may extend to one thousand rupees, or with both. \n343. Wrongful confinement for three or more days.—Whoever wrongfully confines any person for \nthree days, or more, shall be punished with imprisonment of either description  for a term which may \nextend to two years, or with fine, or with both. \n344. Wrongful con finement for ten or more days .—Whoever wrongfully confines any person for \nten days, or more, shall be punished with imprisonment of either description for a term which may extend \nto three years, and shall also be liable to fine. \n345. Wrongful confinement of person for whose liberation writ has been issued .—Whoever \nkeeps any person in wrongful confinement, knowing that a writ for the liberation of  that person has been \nduly issued, shall be punished with imprisonment of either description for a term w hich may extend to \ntwo years in addition to any term of imprisonment to which he may be li able under any other section of \nthis Chapter. \n346. Wrongful confinement in secret.—Whoever wrongfully confines any person in such manner as \nto indicate an intention that the confinement of such person may not be known to any per son interested in \nthe person so confined, or to any public servant, or that the place of such confinement may not be known \nto or discovered by any such person or public servant as hereinbefore mentioned, shall b e punished with \nimprisonment of either description for a term which may extend to two years in addition to any other \npunishment to which he may be liable for such wrongful confinement. \n347. Wrongful confinement to extort property, or constrain to illegal act .—Whoever wrongfully \nconfines any person for the purpose of extorting from the person confined, or from an y person interested \nin the person confined, any property or valuable security or of constraining the person confined or any \nperson interested in such person to do anything illegal or to give any information which may facilitate the \ncommission of an offence, shall be punished with imprisonment of either description for a term which \nmay extend to three years, and shall also be liable to fine. \n348. Wrongful confinement to extort confession, or compel restoration of property .—Whoever \nwrongfully confines any person for the purpose of extorting from the person confined or any person \ninterested in the person confined any confession or any information which may lead to the detection of an \noffence or misconduct, or for the purpose of constraining the person confined or any  person interested in \nthe person confined to restore or to cause the restoration of any property or v aluable security or to satisfy \nany claim or demand, or to give information which may lead to the restoration of any property or valuable \nsecurity, shall be punished with imprisonment of either description for a term  which may extend to three \nyears, and shall also be liable to fine. \n  \n82 \n \nOf Criminal Force and Assault \n349. Force .—A person is said to use force to another if he causes motion, change of motion, o r \ncessation of motion to that other, or if he causes to any substance such motion, or  change of motion, or \ncessation of motion as brings that substance into contact with any part of that ot her's body, or with \nanything which that other is wearing or carrying, or with anything so situated that such contact affects that \nother's sense of feeling: Provided that the person causing the motion, or change of motion, or cessation of \nmotion, causes that motion, change of motion, or cessation of motion in one of the th ree ways hereinafter \ndescribed: \nFirst.—By his own bodily power. \nSecondly.—By disposing any substance in such a manner that the motion or change or cessation of \nmotion takes place without any further act on his part, or on the part of any other person. \nThirdly.—By inducing any animal to move, to change its motion, or to cease to move. \n350. Criminal force.—Whoever intentionally uses force to any person, without that person's consent, \nin order to the committing of any offence, or intending by the use of such force to cause, or knowing it to \nbe likely that by the use of such force he will cause injury, fear or annoyanc e to the person to whom th e \nforce is used, is said to use criminal force to that other. \nIllustrations \n(a) Z is sitting in a moored boat on a river. A unfastens the moorings, and thus intentionally causes the boat to drift down the \nstream. Here A intentionally causes motion to Z, and he does this by disposing substances in such a manner that the motion is \nproduced without any other action on any person's part. A ha s therefore intentionally used force to Z; and if he has done so \nwithout Z's consent, in order to the committing of any offence , or intending or knowing it to be likely that this use of force will \ncause injury, fear or annoyance to Z, A has used criminal force to Z. \n(b) Z is riding in a chariot. A lashes Z's horses, and thereby causes them to  quicken their pace. Here A has caused change of \nmotion to Z by inducing the animals to change their motion. A has th erefore used force to Z; and if A has done this without Z's \nconsent, intending or knowing it to be likely that he may thereby injure, frighten or annoy Z, A has used criminal force to Z. \n(c) Z is riding in a palanquin. A, intending to rob Z, seizes the pole a nd stops the palanquin. Here A has caused cessation of \nmotion to Z, and he has done this by his own bodily power. A has therefore used force to Z; and as A has acted thus intentionally, \nwithout Z's consent, in order to the commission of an offence. A has used criminal force to Z. \n(d) A intentionally pushes against Z in the street. Here A has by his own b odily power moved his own person so as to bring \nit into contact with Z. He has therefore intentionally used force to Z; a nd if he has done so without Z's consent, intending or \nknowing it to be likely that he may thereby injure, frighten or annoy Z, he has used criminal force to Z. \n(e) A throws a stone, intending or knowing it to be likely that the stone will be thus brought into contact with Z, or with Z's \nclothes, or with something carried by Z, or that it will strike water and d ash up the water against Z's clothes or something carried \nby Z. Here, if the throwing of the stone produce the effect of causing any substance to come into contact with Z, or Z's clothes, A \nhas used force to Z; and if he did so without Z's consent, inten ding thereby to injure, frighten or annoy Z, he has used criminal \nforce to Z. \n(f) A intentionally pulls up a woman's veil. Here A intentionally uses fo rce to her, and if he does so without her consent \nintending or knowing it to be likely that he may thereby injure, frighten or annoy her, he has used criminal force to her. \n(g) Z is bathing. A pours into the bath water which he knows to be boil ing. Here A intentionally by his own bodily power \ncauses such motion in the boiling water as brings that water into con tact with Z, or with other water so situated that such contact \nmust affect Z's sense of feeling; A has therefore intentionally used forc e to Z; and if he has done this without Z's consent \nintending or knowing it to be likely that he may thereby cause injury, fear or annoyance to Z, A has used criminal force. \n(h) A incites a dog to spring upon Z, without Z's consent. Here, if  A intends to cause injury, fear or annoyance to Z, he uses \ncriminal force to Z. \n351. Assault.—Whoever makes any gesture, or any preparation intending or knowing it to be l ikely \nthat such gesture or preparation will cause any person present to apprehend that he who m akes that \ngesture or preparation is about to use criminal force to that person, is said to commit an assault. \nExplanation.—Mere words do not amount to an assault. But the words which a person uses may give \nto his gestures or preparation such a meaning as may make those gestures or preparat ions amount to an \nassault. \nIllustrations \n(a) A shakes his fist at Z, intending or knowing it to be likely that he may thereby cause Z to believe that A is about to stri ke \nZ. A has committed an assault. \n(b) A begins to unloose the muzzle of a ferocious dog, intending or kn owing it to be likely that he may thereby cause Z to \nbelieve that he is about to cause the dog to attack Z. A has committed an assault upon Z. \n83 \n \n(c) A takes up a stick, saying to Z, “I will give you a beating”. Here, though the words used by A could in no case amount to \nan assault, and though the mere gesture, unaccompanied by an y other circumstances, might not amount to an assault, the gesture \nexplained by the words may amount to an assault. \n352. Punishment for assault or criminal force otherwise than on grave provocation .—Whoever \nassaults or uses criminal force to any person otherwise than on grave and sudden provocation given by \nthat person, shall be punished with imprisonment of either description for a term  which may extend to \nthree months, or with fine which may extend to five hundred rupees, or with both. \nExplanation.—Grave and sudden provocation will not mitigate the punishment for an offence under \nthis section, if the provocation is sought or voluntarily provoked by the of fender as an excuse for the \noffence, or \nif the provocation is given by anything done in obedience to the law, or by a p ublic servant, in the \nlawful exercise of the powers of such public servant, or \nif the provocation is given by anything done in the lawful exercise of the right of private defence. \n Whether the provocation was grave and sudden enough to mitigate the offence, is a question of fact. \n353. Assault or criminal force to deter public servant from discharge of his duty .—Whoever \nassaults or uses criminal force to any person being a public servant in the execution of his duty as such \npublic servant, or with intent to prevent or deter that person from discharging his duty as such public \nservant, or in consequence of anything done or attempted to be done by such person to th e lawful \ndischarge of his duty as such public servant, shall be punished with imprisonment of either description for \na term which may extend to two years, or with fine, or with both. \nSTATE AMENDMENT \nMaharashtra.— \nAmendment of section 353 of 45 of 1860. —In section 353 of the said Code, for the words “two \nyears” the words “five years” shall be substituted. \n[Vide Maharashtra Act 40 of 2018, sec. 3] \n354. Assault or criminal force to woman with intent to outrage her modesty .—Whoever assaults \nor uses criminal force to any woman, intending to outrage or knowing it to be lik ely that he will there by \noutrage her modesty, 1[shall be punished with imprisonment of either description for a term which shall not be less \nthan one year but which may extend to five years, and shall also be liable to fine]. \nSTATE AMENDMENT \nChhattisgarh \nIn Section 354 of the Penal Code, the following proviso shall be inserted, namely: — \nProvided that where offence is committed, under this Section by a relative, guardian or t eacher or a \nperson in a position of trust or authority towards the person assaulted, he shall be punishabl e with \nimprisonment of either description for a term which shall not be less than two years but which may extend \nto seven years and shall also be liable to fine. \n[Vide Chhattisgarh Act 25 of 2015, sec. 3] \n2[354A. Sexual harassment and punishment for sexual harassment.—(1) A man committing any of \nthe following acts— \n(i) physical contact and advances involving unwelcome and explicit sexual overtures; or \n                                                           \n1. Subs. by Act 13 of 2013, s. 6, for “shall be punished with imprisonment of either description for a term which may extend to two years, or \nwith fine, or with both” (w.e.f. 3-2-2013). \n2. Ins. by s. 7, ibid., (w.e.f. 3-2-2013). \n84 \n \n(ii) a demand or request for sexual favours; or \n(iii) showing pornography against the will of a woman; or \n(iv) making sexually coloured remarks,  \nshall be guilty of the offence of sexual harassment. \n(2) Any man who commits the offence specified in clause ( i) or clause ( ii) or clause ( iii) of  \nsub-section (1) shall be punished with rigorous imprisonment for a term which may extend to three years, \nor with fine, or with both. \n(3) Any man who commits the offence specified in clause ( iv) of sub-section ( 1) shall be punished \nwith imprisonment of either description for a term which may extend to one year, or with fine, or with \nboth. \n354B. Assault or use of criminal force to woman with intent to disrobe .—Any man who assaults \nor uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to \nbe naked, shall be punished with imprisonment of either description for a term w hich shall not be less \nthan three years but which may extend to seven years, and shall also be liable to fine. \n354C. Voyeurism.—Any man who watches, or captures the image of a woman engaging in a private \nact in circumstances where she would usually have the expectation of not being obse rved either by the \nperpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be \npunished on first conviction with imprisonment of either description for a term  which shall not be less \nthan one year, but which may extend to three years, and shall also be liable to fine, and be punished on a \nsecond or subsequent conviction, with imprisonment of either description for a term which shall not be \nless than three years, but which may extend to seven years, and shall also be liable to fine. \n Explanation 1.—For the purpose of this section, “private act” includes an act of watching carried out \nin a place which, in the circumstances, would reasonably be expected to provide pri vacy and where the \nvictim's genitals, posterior or breasts are exposed or covered only in underwear; or the victim is using a \nlavatory; or the victim is doing a sexual act that is not of a kind ordinarily done in public. \nExplanation 2.—Where the victim consents to the capture of the images or any act, but not to t heir \ndissemination to third persons and where such image or act is disseminated, such disseminati on shall be \nconsidered an offence under this section. \n354D. Stalking.—(1) Any man who— \n(i) follows a woman and contacts, or attempts to contact such woman to foster personal  \ninteraction repeatedly despite a clear indication of disinterest by such woman; or \n(ii) monitors the use by a woman of the internet, email or any other form of electronic \ncommunication, \ncommits the offence of stalking: \nProvided that such conduct shall not amount to stalking if the man who pursued it pr oves \nthat— \n(i) it was pursued for the purpose of preventing or detecting crime and the man accuse d \nof stalking had been entrusted with the responsibility of prevention and detection of crime by \nthe State; or \n(ii) it was pursued under any law or to comply with any condition or requirement \nimposed by any person under any law; or \n(iii) in the particular circumstances such conduct was reasonable and justified. \n(2) Whoever commits the offence of stalking shall be punished on first conviction with imprisonment \nof either description for a term which may extend to three years, and shall a lso be liable to fine; and be \npunished on a second or subsequent conviction, with imprisonment of either description for a term which \nmay extend to five years, and shall also be liable to fine.] \nSTATE AMENDMENT \nJammu and Kashmir and Ladakh (UTs) \nAfter section 354D, insert the following section, namely:- \n85 \n \n354E. Sextortion.—(1) Whoever,— \n(a) being in a position of authority; or \n(b) being in a fiduciary relationship; or \n(c) being a public servant, \nabuses such authority or fiduciary relationship or misuses his official posi tion to employ physical or non \nphysical forms of coercion to extort or demand sexual favours from any woman in ex change of some \nbenefits or other favours that such person is empowered to grant or withhold, shall  be guilty of offence of \nsextortion. \nExplanation.–For the purpose of this section, ‘sexual favour ’ shall mean and include any kind of \nunwanted sexual activity ranging from sexually suggestive conduct, sexually explic it actions such as \ntouching, exposure of private body parts to sexual intercourse, including exposure over the el ectronic \nmode of communication. \n(2) Any person who commits the offence of sextortion shall be punished with rigorous imprisonment \nfor a term which shall not be less than three years but may extend to five years and with fine. \n[Ins. by the Jammu and Kashmir Reorganization (Adaptation of Central Laws) Orde r, 2020, vide \nnotification No. S.O. 1123( E) dated (18-3-2020) and vide Union Territory of Ladakh Reorganisation \n(Adaptation of Central Laws) Order, 2020, notification No. S.O.3774(E), dated (23-10-2020). \nChhattisgarh \nAfter Section 354D of the Penal Code, the following shall be inserted, namely:— \n354E. Liability person present who fails to prevent the commission of offence under Section 354, \n354A, 354B, 354C, 354D.— \nWhoever, being present at the time of commission of an offence under section 354, sec tion 354A, \nsection 354B, section 354C or section 354D and being able to prevent such offence, f ails to prevent the \ncommission of such offence or not being in position to prevent the commission of s uch offence, fails to \ngive information of the commission of such offence to the nearest magistrate o r police officer, by any \nmode, with the intention of screening the offender from legal punishment, shall be liable for abetment of \nsuch offence and shall be punished with imprisonment of either description which m ay extend to three \nyears or with fine or with both.] \n[Vide Chhattisgarh Act 25 of 2015, s. 3] \nArunachal Pradesh \nAmendment of section 354. —In section 354 of the principal Act, for the words “shall be punished \nwith imprisonment of either description for a term which shall not be less  than one year but which may \nextend to five years, and shall also be liable to fine “the words “ shall be punished with imprisonment of \neither description for a term which shall not be less than two years but which may extend to seven years, \nand shall also be liable to fine” shall be substituted. \n[Vide Arunachal Pradesh Act 3 of 2019, s. 5] \nAmendment of section 354B .—In section 354B of the principal Act, for the words “shall be \npunished with imprisonment of either description for a term which shall not be less t han three years but \nwhich may extend to seven years and shall also be liable to fine ” the words “shall be punished on first \nconviction with imprisonment of either description for a term which shall not be less than three years but \nwhich may extend to seven years and shall also be liable to fine; and be punished on a second or  \nsubsequent convicting with rigorous imprisonment for a term which shall not be less than seven years but \nwhich may extend to ten years with fine which shall not be less than one lakh rupees” shall be substituted. \n[Vide Arunachal Pradesh Act 3 of 2019, s. 6] \nAmendment of section 354D. —In section 354D of the principal Act, for sub-section (2),  the following \nsub-section shall be substituted, namely:-- \n“(2) Whoever commits the offence of stalking shall be punished on first conviction w ith \nimprisonment of either description for a term which may extend to three years and sha ll also be liable to \nfine; and be punished on a second or subsequent conviction with imprisonment or either descr iption for a \n86 \n \nterm which shall not be less than three years but which may extend to sev en years and with fine which \nshall not be less than one lakh rupees: \nProvided that the count may, for adequate and special reasons to be mentioned in the j udgment, \nimpose a sentence of lesser period of imprisonment than specified minimum imprisonment.”. \n[Vide Arunachal Pradesh Act 3 of 2019, s.7] \n355. Assault or criminal force with intent to dishonour person, otherwise than on grave \nprovocation.—Whoever assaults or uses criminal force to any person, intending thereby to disho nor that \nperson, otherwise than on grave and sudden provocation given by that person, shall be punished with \nimprisonment of either description for a term which may extend to two years, or with fine, or with both.  \n356. Assault or criminal force in attempt to commit theft of property carried by a person .—\nWhoever assaults or uses criminal force to any person, in attempting to commit theft on any property \nwhich that person is then wearing or carrying, shall be punished with imprisonment of eit her description \nfor a term which may extend to two years, or with fine, or with both. \n357. Assault or criminal force in attempt wrongfully to confine a person .—Whoever assaults or \nuses criminal force to any person, in attempting wrongfully to confine that pe rson, shall be punished with \nimprisonment of either description for a term which may extend to one year, or with fine which may \nextend to one thousand rupees, or with both. \n358. Assault or criminal force on grave provocation .—Whoever assaults or uses criminal force to \nany person on grave and sudden provocation given by that person, shall be punished with simple \nimprisonment for a term which may extend to one month, or with fine which may extend to two hundred \nrupees, or with both. \nExplanation.—The last section is subject to the same Explanation as section 352. \nOf Kidnapping, Abduction, Slavery and Forced Labour \n359. Kidnapping .—Kidnapping is of two kinds: kidnapping from 1[India], and kidnapping from \nlawful guardianship. \n360. Kidnapping from India .—Whoever conveys any person beyond the limits of 1[India] without \nthe consent of that person, or of some person legally authorised to consent on behalf of that person, is said \nto kidnap that person from 1[India]. \n361. Kidnapping from lawful guardianship.—Whoever takes or entices any minor under 2[sixteen] \nyears of age if a male, or under 3[eighteen] years of age if a female, or any person of unsound mind, out of \nthe keeping of the lawful guardian of such minor or person of unsound mind, without the consent  of such \nguardian, is said to kidnap such minor or person from lawful guardianship. \nExplanation.—The words “lawful guardian ” in this section include any person lawfully entrusted \nwith the care or custody of such minor or other person. \nException.—This section does not extend to the act of any person who in good faith believes himsel f \nto be the father of an illegitimate child, or who in good faith believes himself  to be entitled to the lawful \ncustody of such child, unless such act is committed for an immoral or unlawful purpose. \n362. Abduction.—Whoever by force compels, or by any deceitful means induces, any person to go \nfrom any place, is said to abduct that person. \n363. Punishment for kidnapping .—Whoever kidnaps any person from 1[India] or from lawful \nguardianship, shall be punished with imprisonment of either description for a term w hich may extend to \nseven years, and shall also be liable to fine. \n4[363A. Kidnapping or maiming a minor for purposes of begging .—(1) Whoever kidnaps any \nminor or, not being the lawful guardian of a minor, obtains the custody of the mi nor, in order that such \n                                                           \n1. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch., \nto read as above. \n2. Subs. by Act 42 of 1949, s. 2, for “fourteen”. \n3. Subs. by s. 2, ibid., for “sixteen”. \n4. Ins. by Act 52 of 1959, s. 2 (w.e.f. 15-1-1960). \n87 \n \nminor may be employed or used for the purposes of begging shall be punishable with imprisonment of \neither description for a term which may extend to ten years, and shall also be liable to fine. \n(2) Whoever maims any minor in order that such minor may be employed or used for the purposes of \nbegging shall be punishable with imprisonment for life, and shall also be liable to fine. \n(3) Where any person, not being the lawful guardian of a minor, employs or uses such minor for the \npurposes of begging, it shall be presumed, unless the contrary is proved, that he kidnapped or otherwise \nobtained the custody of that minor in order that the minor might be employed or used for the purposes of \nbegging. \n(4) In this section,— \n(a) “begging” means— \n(i) soliciting or receiving alms in a public place, whether under the pretence of singing, \ndancing, fortunetelling, performing tricks or selling articles or otherwise; \n(ii) entering on any private premises for the purpose of soliciting or receiving alms; \n(iii) exposing or exhibiting, with the object of obtaining or extorting alms, any sor e, wound, \ninjury, deformity or disease, whether of himself or of any other person or of an animal; \n(iv) using a minor as an exhibit for the purpose of soliciting or receiving alms; \n(b) “minor” means— \n(i) in the case of a male, a person under sixteen years of age; and \n(ii) in the case of a female, a person under eighteen years of age.]  \n364. Kidnapping or abducting in order to murder .—Whoever kidnaps or abducts any person in \norder that such person may be murdered or may be so disposed of as to be put in danger of be ing \nmurdered, shall be punished with 1[imprisonment for life] or rigorous imprisonment for a term which may \nextend to ten years, and shall also be liable to fine. \nIIIustrations \n(a) A kidnaps Z from 2[India], intending or knowing it to be likely that Z may be sacri ficed to an idol. A has committed the \noffence defined in this section. \n(b) A forcibly carries or entices B away from his home in order that B may be murdered. A has committed the offence \ndefined in this section. \n3[364A. Kidnapping for ransom, etc.—Whoever kidnaps or abducts any person or keeps a person in \ndetention after such kidnapping or abduction, and threatens to cause death or hurt to suc h person, or by \nhis conduct gives rise to a reasonable apprehension that such person may be put to death or hurt, or causes \nhurt or death to such person in order to compel the Government or 4[any foreign State or international \ninter-governmental organisation or any other person] to do or abstain from doing any act or to pay a \nransom, shall be punishable with death, or imprisonment for life, and shall also be liable to fine.] \n365. Kidnapping or abducting with intent secretly and wrongfully to confine person .—Whoever \nkidnaps or abducts any person with intent to cause that person to be secretly and wrong fully confined, \nshall be punished with imprisonment of either description for a term w hich may extend to seven years, \nand shall also be liable to fine. \n366. Kidnapping, abducting or inducing woman to compel her marriage, etc.—Whoever kidnaps \nor abducts any woman with intent that she may be compelled, or knowing it to be l ikely that she will be \ncompelled, to marry any person against her will, or in order that she may be forced or seduced to illicit \nintercourse, or knowing it to be likely that she will be forced or seduced to illicit intercourse, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch., \nto read as above. \n3. Ins. by Act 42 of 1993, s. 2. \n4. Subs. by Act 24 of 1995, s. 2, for “any other person”. \n88 \n \nbe liable to fine; 1[and whoever, by means of criminal intimidation as defined in this Code or of abuse of \nauthority or any other method of compulsion, induces any woman to go from any place wit h intent that \nshe may be, or knowing that it is likely that she will be, forced or seduced t o illicit intercourse with \nanother person shall also be punishable as aforesaid]. \n2[366A. Procuration of minor girl .—Whoever, by any means whatsoever, induces any minor girl \nunder the age of eighteen years to go from any place or to do any act with inten t that such girl may be, or \nknowing that it is likely that she will be, forced or seduced to illici t intercourse with another person shall \nbe punishable with imprisonment which may extend to ten years, and shall also be liable to fine. \n366B. Importation of girl from foreign country .—Whoever imports into 3[India] from any country \noutside India 4[or from the State of Jammu and Kashmir] any girl under the age of twenty- one years with \nintent that she may be, or knowing it to be likely that she will be, forced or seduced to illicit intercourse \nwith another person, 5***shall be punishable with imprisonment which may extend to ten years and shall \nalso be liable to fine.] \n367. Kidnapping or abducting in order to subject person to grievous hurt, slavery, etc .—\nWhoever kidnaps or abducts any person in order that such person may be subjected, or may be so \ndisposed of as to be put in danger of being subjected to grievous hurt, or slavery, or  to the unnatural lust \nof any person, or knowing it to be likely that such person will be so subjected or dispose d of, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine. \n368. Wrongfully concealing or keeping in confinement, kidnapped or abducted person .—\nWhoever, knowing that any person has been kidnapped or has been abducted, wrongfully conceals or \nconfines such person, shall be punished in the same manner as if he had kidnapped or abducted such \nperson with the same intention or knowledge, or for the same purpose as that wit h or for which he \nconceals or detains such person in confinement. \n369. Kidnapping or abducting child under ten years with intent to steal from its person .—\nWhoever kidnaps or abducts any child under the age of ten years with the intenti on of taking dishonestly \nany movable property from the person of such child, shall be punished with impri sonment of either \ndescription for a term which may extend to seven years, and shall also be liable to fine. \n6[370. Trafficking of person.—(1) Whoever, for the purpose of exploitation, (a) recruits, (b) transports, \n(c) harbours, (d) transfers, or (e) receives, a person or persons, by— \nFirst.—using threats, or \nSecondly.—using force, or any other form of coercion, or \nThirdly.—by abduction, or \nFourthly.—by practising fraud, or deception, or \nFifthly.—by abuse of power, or \nSixthly.—by inducement, including the giving or receiving of payments or benefits, in order to achieve \nthe consent of any person having control over the person recruited, transported, harboured, transferred or \nreceived, \ncommits the offence of trafficking. \nExplanation 1.—The expression \"exploitation\" shall include any act of physical exploitation or any form \nof sexual exploitation, slavery or practices similar to slavery, servitude, or the forced removal of organs. \nExplanation 2. —The consent of the victim is immaterial in determination of the offence of \ntrafficking. \n(2) Whoever commits the offence of trafficking shall be punished with rigorous im prisonment for a \nterm which shall not be less than seven years, but which may extend to ten years, and shall  also be liable \nto fine. \n                                                           \n1. Ins. by Act 20 of 1923, s. 2.  \n2. Ins. by s. 3, ibid. \n3. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch., \nto read as above. \n4. Ins. by Act 3 of 1951, s. 3 and the Sch., (w.e.f. 1-4-1951). \n5. Certain words omitted by s. 3 and the Sch., ibid. \n6. Subs. by Act 13 of 2013, s. 8, for section 370 (w.e.f. 3-2-2013). \n89 \n \n(3) Where the offence involves the trafficking of more than one person, it shall be punishable with rigorous \nimprisonment for a term which shall not be less than ten years but which may extend to imprisonment for life, and \nshall also be liable to fine. \n(4) Where the offence involves the trafficking of a minor, it shall be punishable with rigorous imprisonment for \na term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable \nto fine. \n(5) Where the offence involves the trafficking of more than one minor, it sh all be punishable with \nrigorous imprisonment for a term which shall not be less than fourteen years, bu t which may extend t o \nimprisonment for life, and shall also be liable to fine. \n(6) If a person is convicted of the offence of trafficking of minor on more than one occasion, then \nsuch person shall be punished with imprisonment for life, which shall mean imprisonment for the \nremainder of that person's natural life, and shall also be liable to fine. \n(7) When a public servant or a police officer is involved in the trafficking of  any person then, such \npublic servant or police officer shall be punished with imprisonment for lif e, which shall mean \nimprisonment for the remainder of that person’s natural life, and shall also be liable to fine. \n370A. Exploitation of a trafficked person. —(1) Whoever, knowingly or having reason to believe \nthat a minor has been trafficked, engages such minor for sexual exploitati on in any manner, shall be \npunished with rigorous imprisonment for a term which shall not be less than fi ve years, but which may \nextend to seven years, and shall also be liable to fine. \n(2) Whoever, knowingly by or having reason to believe that a person has been traf ficked, engages \nsuch person for sexual exploitation in any manner, shall be punished with rigorous i mprisonment for a \nterm which shall not be less than three years, but which may extend to five yea rs, and shall also be liable \nto fine.] \n371. Habitual dealing in slaves.—Whoever habitually imports, exports, removes, buys, sells, traffics \nor deals in slaves, shall be punished with 1[imprisonment for life], or with imprisonment of either \ndescription for a term not exceeding ten years, and shall also be liable to fine. \n372. Selling minor for purposes of prostitution, etc .—Whoever sells, lets to hire, or otherwise \ndisposes of any 2[person under the age of eighteen years with intent that such person shall at any age be \nemployed or used for the purpose of prostitution or illicit intercourse with any  person or for any unlawful \nand immoral purpose, or knowing it to be likely that such person will at any age be] employed or used for \nany such purpose, shall be punished with imprisonment of either description for a term which may extend \nto ten years, and shall also be liable to fine. \n3[Explanation I.—When a female under the age of eighteen years is sold, let for hire, or otherwise \ndisposed of to a prostitute or to any person who keeps or manages a brothel, th e person so disposing of \nsuch female shall, until the contrary is proved, be presumed to have disposed of her with the i ntent that \nshe shall be used for the purpose of prostitution. \nExplanation II .—For the purposes of this section “illicit intercourse ” means sexual intercourse \nbetween persons not united by marriage or by any union or tie which, though not amounting t o a \nmarriage, is recognised by the personal law or custom of the community to which t hey belong or, where \nthey belong to different communities, of both such communities, as constituting  between them a quasi-\nmarital relation.] \n373. Buying minor for purposes of prostitution, etc .—Whoever buys, hires or otherwise obtains \npossession of any 4[person under the age of eighteen years with intent that such person shall at any age be \nemployed or used for the purpose of prostitution or illicit intercourse with any  person or for any unlawful \nand immoral purpose, or knowing it to be likely that such person will at any age be] employed or used for \nany such purpose, shall be punished with imprisonment of either description for a term which may extend \nto ten years, and shall also be liable to fine. \n5[Explanation I.—Any prostitute or any person keeping or managing a brothel, who buys, hires or \notherwise obtains possession of a female under the age of eighteen years shall, unt il the contrary is \nproved, be presumed to have obtained possession of such female with the intent that she shall be used for \nthe purpose of prostitution. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. Subs. by Act 18 of 1924, s. 2, for certain words. \n3. Ins. by Act 18 of 1924, s. 3 \n4. Subs. by s. 2, ibid., for certain words. \n5. Ins. by s. 4, ibid. \n90 \n \nExplanation II.—“Illicit intercourse” has the same meaning as in section 372.] \n374. Unlawful compulsory labour.—Whoever unlawfully compels any person to labour against the \nwill of that person, shall be punished with imprisonment of either description f or a term which may \nextend to one year, or with fine, or with both. \n1[Sexual offences] \n2[375. Rape.—A man is said to commit “rape” if he— \n(a) penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or \nmakes her to do so with him or any other person; or \n(b) inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the \nurethra or anus of a woman or makes her to do so with him or any other person; or \n(c) manipulates any part of the body of a woman so as to cause penetration into the vagina, \nurethra, anus or any part of body of such woman or makes her to do so with him or any  other person; \nor \n(d) applies his mouth to the vagina, anus, urethra of a woman or makes her to do so  with him or \nany other person, \nunder the circumstances falling under any of the following seven descriptions:— \nFirst.—Against her will. \nSecondly.—Without her consent. \nThirdly.—With her consent, when her consent has been obtained by putting her or any person in  \nwhom she is interested, in fear of death or of hurt. \nFourthly.—With her consent, when the man knows that he is not her husband and that her \nconsent is given because she believes that he is another man to whom she is or bel ieves herself to be \nlawfully married. \nFifthly.—With her consent when, at the time of giving such consent, by reason of unsoundness of \nmind or intoxication or the administration by him personally or through another of any stupefying or \nunwholesome substance, she is unable to understand the nature and consequences of that to which she \ngives consent. \nSixthly.—With or without her consent, when she is under eighteen years of age. \nSeventhly.—When she is unable to communicate consent. \nExplanation 1.—For the purposes of this section, “vagina” shall also include labia majora. \nExplanation 2. —Consent means an unequivocal voluntary agreement when the woman by words, \ngestures or any form of verbal or non-verbal communication, communicates willing ness to participate in \nthe specific sexual act: \nProvided that a woman who does not physically resist to the act of penetration shall not by the reason \nonly of that fact, be regarded as consenting to the sexual activity. \nException 1.—A medical procedure or intervention shall not constitute rape. \nException 2.—Sexual intercourse or sexual acts by a man with his own wife, the wife not being under \nfifteen years of age, is not rape. \n376. Punishment for rape .—(1) Whoever, except in the cases provided for in sub-section ( 2), \ncommits rape, shall be punished with rigorous imprisonment of either description for a term which 3[shall \nnot be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine]. \n(2) Whoever,— \n(a) being a police officer, commits rape— \n                                                           \n1. Subs. by Act 43 of 1983, s. 3, for the heading “Of rape” and ss. 375 and 376. \n2. Subs. by Act 13 of 2013, s. 9, for sections 375, 376, 376A, 376B, 376C and 376D (w.e.f. 03-02-2013). \n3. Subs. by Act 22 of 2018, s. 4, for “shall not be less than seven years, but which may extend to imprisonment for life, and shall \nalso be liable to fine” (w.e.f. 21-4-2018). \n91 \n \n(i) within the limits of the police station to which such police officer is appointed; or \n(ii) in the premises of any station house; or \n(iii) on a woman in such police officer's custody or in the custody of a police office r \nsubordinate to such police officer; or \n(b) being a public servant, commits rape on a woman in such public servant's custody or in the \ncustody of a public servant subordinate to such public servant; or \n(c) being a member of the armed forces deployed in an area by the Central or a State Government \ncommits rape in such area; or \n(d) being on the management or on the staff of a jail, remand home or other place of custody \nestablished by or under any law for the time being in force or of a women' s or children's institution, \ncommits rape on any inmate of such jail, remand home, place or institution; or \n(e) being on the management or on the staff of a hospital, commits rape on a woman i n that \nhospital; or \n(f) being a relative, guardian or teacher of, or a person in a position of trust or  authority towards \nthe woman, commits rape on such woman; or \n(g) commits rape during communal or sectarian violence; or \n(h) commits rape on a woman knowing her to be pregnant; or \n1*   *   *   *  * \n(j) commits rape, on a woman incapable of giving consent; or \n(k) being in a position of control or dominance over a woman, commits rape on such woman; or \n(l) commits rape on a woman suffering from mental or physical disability; or \n(m) while committing rape causes grievous bodily harm or maims or disfigures or endangers the \nlife of a woman; or \n(n) commits rape repeatedly on the same woman, \nshall be punished with rigorous imprisonment for a term which shall not be less than ten years, but which \nmay extend to imprisonment for life, which shall mean imprisonment for the re mainder of that person's \nnatural life, and shall also be liable to fine. \nExplanation.—For the purposes of this sub-section,— \n(a) “armed forces ” means the naval, military and air forces and includes any member of the \nArmed Forces constituted under any law for the time being in force, including the par amilitary forces \nand any auxiliary forces that are under the control of the Central Government or the State \nGovernment; \n(b) “hospital” means the precincts of the hospital and includes the precincts of any inst itution for \nthe reception and treatment of persons during convalescence or of persons requiring medical attention \nor rehabilitation; \n(c) “police officer” shall have the same meaning as assigned to the expression “police” under the \nPolice Act, 1861 (5 of 1861); \n(d) “women's or children's institution ” means an institution, whether called an orphanage or a \nhome for neglected women or children or a widow's home or an institution called by any  other name, \nwhich is established and maintained for the reception and care of women or children. \n2[(3) Whoever, commits rape on a woman under sixteen years of age shall be punished with \nrigorous imprisonment for a term which shall not be less than twenty years, but whi ch may extend to \nimprisonment for life, which shall mean imprisonment for the remainder of that person' s natural life, \nand shall also be liable to fine: \n                                                           \n1. Clause (i) omitted by Act 22 of 2018 s. 4. (w.e.f. 21-4-2018). \n2. Ins. by s. 4. ibid., (w.e.f. 21-4-2018). \n92 \n \n Provided that such fine shall be just and reasonable to meet the medical expenses and  \nrehabilitation of the victim:  \nProvided further that any fine imposed under this sub-section shall be paid to the victim.] \n1[376A. Punishment for causing death or resulting in persistent vegetative state of victi m.—\nWhoever, commits an offence punishable under sub-section ( 1) or sub-section ( 2) of section 376 and in \nthe course of such commission inflicts an injury which causes the death of the w oman or causes the \nwoman to be in a persistent vegetative state, shall be punished with rigorous i mprisonment for a term \nwhich shall not be less than twenty years, but which may extend to imprisonment for life, which shall \nmean imprisonment for the remainder of that person's natural life, or with death. \nSTATE AMENDMENT \nArunachal Pradesh \nInsertion of section 376AA.—After section 376A of the principal act, the following section shall \nbe inserted, namely:- \n“376AA. Punishment for rape on a women up to twelve years of age .—Whoever commits rape on \na women up to twelve years of age shall be punished with death, or rigorous im prisonment for a term \nwhich shall not be less than fourteen years but which may extend to imprisonment for  life which shall \nmean imprisonment for the remained of that person’s natural life, and shall also be liable to fine.”. \n[Vide Arunachal Pradesh Act 3 of 2019, s. 8] \nInsertion of section 376DA.—After section 376D of the principal Act, the following section shall be \ninserted namely:-- \n“376D.Punishment for gang rape on a woman twelve years of age.—Where a woman up to twelve \nyears of age, is raped by one or more persons constituting a group of action in furt herance of a common \nintention, each of those persons shall be deemed to have committed the offence of rape  and shall be \npunished with death, or rigorous imprisonment for a term which shall not be less than twe nty years, but \nwhich may extend to imprisonment for life which shall mean imprisonment for the remai nder of that \nperson’s natural life, and shall also be liable to fine: \nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of \nthe victim: \nProvided further that any fine imposed under this section shall be paid to the victim.”. \n[Vide Arunachal Pradesh Act 3 of 2019, s. 9] \n2[376AB.Punishment for rape on woman under twelve years of age. —Whoever, commits rape on \na woman under twelve years of age shall be punished with rigorous imprisonment for  a term which shall \nnot be less than twenty years, but which may extend to imprisonment for life, wh ich shall mean \nimprisonment for the remainder of that person's natural life, and with fine or with death:  \nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of \nthe victim: \nProvided further that any fine imposed under this section shall be paid to the victim.] \n1[376B. Sexual intercourse by husband upon his wife during separation .—Whoever has sexual \nintercourse with his own wife, who is living separately, whether under a decree of separation or \notherwise, without her consent, shall be punished with imprisonment of either descri ption for a term \nwhich shall not be less than two years but which may extend to seven years, and shall also be liable to \nfine. \nExplanation.—In this section, “sexual intercourse” shall mean any of the acts mentioned in clauses \n(a) to (d) of section 375. \n1[376C. Sexual intercourse by a person in authority.—Whoever, being— \n(a) in a position of authority or in a fiduciary relationship; or \n                                                           \n1. Subs. by Act 13 of 2013, s. 9, for sections 375, 376, 376A, 376B, 376C and 376D (w.e.f. 03-02-2013). \n2. Ins. by Act 22 of 2018, s. 5 (w.e.f. 21-4-2018). \n \n93 \n \n(b) a public servant; or \n(c) superintendent or manager of a jail, remand home or other place of custody establi shed by or \nunder any law for the time being in force, or a women's or children's institution; or \n(d) on the management of a hospital or being on the staff of a hospital,  \nabuses such position or fiduciary relationship to induce or seduce any woman either in his custody or \nunder his charge or present in the premises to have sexual intercourse with him, such sexua l intercourse \nnot amounting to the offence of rape, shall be punished with rigorous imprisonment  of either description \nfor a term which shall not be less than five years, but which may extend to ten y ears, and shall also be \nliable to fine. \nExplanation 1.—In this section, “sexual intercourse ” shall mean any of the acts mentioned in \nclauses (a) to (d) of section 375. \nExplanation 2. —For the purposes of this section, Explanation 1 to section 375 shall also be \napplicable. \nExplanation 3.—“Superintendent”, in relation to a jail, remand home or other place of custody or \na women's or children ’s institution, includes a person holding any other office in such jail, remand \nhome, place or institution by virtue of which such person can exercise any author ity or control over \nits inmates. \nExplanation 4. —The expressions “hospital” and “women's or children ’s institution ” shall \nrespectively have the same meaning as in Explanation to sub-section (2) of section 376.] \n1[376D. Gang rape.—Where a woman is raped by one or more persons constituting a group or acting \nin furtherance of a common intention, each of those persons shall be deemed to have committ ed the \noffence of rape and shall be punished with rigorous imprisonment for a term which shall not be less than \ntwenty years, but which may extend to life which shall mean imprisonment for the remainder of that \nperson's natural life, and with fine: \nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of \nthe victim: \nProvided further that any fine imposed under this section shall be paid to the victim.] \n2[376DA.Punishment for gang rape on woman under sixteen years of age. —Where a woman \nunder sixteen years of age is raped by one or more persons constituting a group or acting in furtherance of \na common intention, each of those persons shall be deemed to have committed the offence of rape and \nshall be punished with imprisonment for life, which shall mean imprisonment f or the remainder of that \nperson's natural life, and with fine: \n Provided that such fine shall be just and reasonable to meet the medical expenses a nd rehabilitation \nof the victim:  \nProvided further that any fine imposed under this section shall be paid to the victim. \n2[376DB.Punishment for gang rape on woman under twelve years of age. —Where a woman \nunder twelve years of age is raped by one or more persons constituting a group or acting in furtherance of \na common intention, each of those persons shall be deemed to have committed the offence of rape and \nshall be punished with imprisonment for life, which shall mean imprisonment f or the remainder of that \nperson's natural life, and with fine, or with death:  \nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of \nthe victim:  \n                                                           \n1. Subs. by Act 13 of 2013, s. 9, for sections 375, 376, 376A, 376B, 376C and 376D (w.e.f. 03-02-2013). \n2. Ins. by Act 22 of 2018, s. 6 (w.e.f. 21-4-2018). \n94 \n \nProvided further that any fine imposed under this section shall be paid to the victim.] \n376E. Punishment for repeat offenders .—Whoever has been previously convicted of an offence \npunishable under section 376 or section 376A or 1[section 376AB or section 376D or section 376DA or \nsection 376DB,] and is subsequently convicted of an offence punishable under any of the said sect ions \nshall be punished with imprisonment for life which shall mean imprisonment for the remainder of that \nperson's natural life, or with death.]] \nSTATE AMENDMENT \nChhattisgarh \nAfter Section 376E of the Penal Code, the following shall be inserted, namely: — \n376F. Liability of person in-charge of workplace and others to give information about o ffence. \n—Whoever, being person in-charge of any work place or any other person present at such pla ce, having \nknowledge that an offence under section 376 or section 376D, is being committed at such place and being \nin a position to prevent commission of such offence fails so, to prevent such of fence or to give \ninformation of the commission of such offence, to any magistrate or police officer, by any mode, with the \nintention of screening the offender from legal punishment, shall be liable to be puni shed for abetment of \nsuch offence with imprisonment of either description which may extend to three yea rs and fine and no \nsuch person shall incur any liability for giving such information. \nExplanation:—Work-place includes any mode of transport owned, hired or otherwise engaged by the \nperson in-charge of the work place for the conveyance of the woman, who was subjected t o such offence, \nto and from her residence to such work-place. \n[Vide Chhattisgarh Act 25 of 2015, s. 5]. \nOf Unnatural Offences \n377. Unnatural offences .—Whoever voluntarily has carnal intercourse against the order of nature \nwith any man, woman or animal, shall be punished with 2[imprisonment for life], or with imprisonment of \neither description for a term which may extend to ten years, and shall also be liable to fine. \nExplanation.—Penetration is sufficient to constitute the carnal intercourse necessary to th e offence \ndescribed in this section. \nCHAPTER XVII \nOF OFFENCES AGAINST PROPERTY \nOf Theft \n378. Theft.—Whoever, intending to take dishonestly any movable property out of the possession of \nany person without that person's consent, moves that property in order to such taki ng, is said to commi t \ntheft. \nExplanation 1.—A thing so long as it is attached to the earth, not being movable property, i s not the \nsubject of theft; but it becomes capable of being the subject of theft as soon as it is severed from the earth. \nExplanation 2.—A moving effected by the same act which effects the severance may be a theft. \nExplanation 3.—A person is said to cause a thing to move by removing an obstacle which pr evented \nit from moving or by separating it from any other thing, as well as by actually moving it. \nExplanation 4.—A person, who by any means causes an animal to move, is said to move that animal, \nand to move everything which, in consequence of the motion so caused, is moved by that animal. \nExplanation 5.—The consent mentioned in the definition may be express or implied, and may be \ngiven either by the person in possession, or by any person having for that purpose authority either express \nor implied. \nIllustrations \n(a) A cuts down a tree on Z's ground, with the intention of dishonestly tak ing the tree out of Z's possession without Z's \nconsent. Here, as soon as A has severed the tree in order to such taking, he has committed theft. \n                                                           \n1. Subs. by Act 22 of 2018, s. 7, for “section 376D” (w.e.f. 21-4-2018). \n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n95 \n \n(b) A puts a bait for dogs in his pocket, and thus induces Z's dog to follow it. Here, if A's intention be dishonestly to take the \ndog out of Z's possession without Z's consent, A has committed theft as soon as Z's dog has begun to follow A. \n(c) A meets a bullock carrying a box of treasure. He drives the bulloc k in a certain direction, in order that he may \ndishonestly take the treasure. As soon as the bullock begins to move, A has committed theft of the treasure. \n(d) A being Z's servant, and entrusted by Z with the care of Z's plate,  dishonestly runs away with the plate, without Z's \nconsent. A has committed theft. \n(e) Z, going on a journey, entrusts his plate to A, the keeper of a wa rehouse, till Z shall return. A carries the plate to a \ngoldsmith and sells it. Here the plate was not in Z's possession. It could not therefore be taken out of Z's possession, and A has \nnot committed theft, though he may have committed criminal breach of trust. \n(f) A finds a ring belonging to Z on a table in the house which Z occup ies. Here the ring is in Z's possession, and if A \ndishonestly removes it, A commits theft. \n(g) A finds a ring lying on the highroad, not in the possession of any person. A, by taking it, commits no theft, though he \nmay commit criminal misappropriation of property. \n(h) A sees a ring belonging to Z lying on a table in Z's house. Not ven turing to misappropriate the ring immediately for fear \nof search and detection, A hides the ring in a place where it is hig hly improbable that it will ever be found by Z, with the \nintention of taking the ring from the hiding place and selling it w hen the loss is forgotten. Here A, at the time of first moving the \nring, commits theft. \n(i) A delivers his watch to Z, a jeweller, to be regulated. Z carries it to h is shop. A, not owing to the jeweller any debt for \nwhich the jeweller might lawfully detain the watch as a security, enters th e shop openly, takes his watch by force out of Z's hand, \nand carries it away. Here A, though he may have committed crimi nal trespass and assault, has not committed theft, inasmuch as \nwhat he did was not done dishonestly.  \n(j) If A owes money to Z for repairing the watch, and if Z retains the wa tch lawfully as a security for the debt, and A takes \nthe watch out of Z's possession, with the intention of depriving Z o f the property as a security for his debt, he commits theft, \ninasmuch as he takes it dishonestly. \n(k) Again, if A, having pawned his watch to Z, takes it out of Z's poss ession without Z's consent, not having paid what he \nborrowed on the watch, he commits theft, though the watch is his own property inasmuch as he takes it dishonestly. \n(l) A takes an article belonging to Z out of Z's possession without Z's co nsent, with the intention of keeping it until he \nobtains money from Z as a reward for its restoration. Here A takes dishonestly; A has therefor committed theft. \n(m) A, being on friendly terms with Z, goes into Z's library in Z's absence,  and takes away a book without Z's express \nconsent for the purpose merely of reading it, and with the intention of returning it. Here, it is probable that A may have conceived \nthat he had Z's implied consent to use Z's book. If this was A's impression, A has not committed theft. \n(n) A asks charity from Z's wife. She gives A money, food and cl othes, which A knows to belong to Z her husband. Here it \nis probable that A may conceive that Z's wife is authorised to give aw ay alms. If this was A's impression, A has not committed \ntheft. \n(o) A is the paramour of Z's wife. She gives a valuable property, which A  knows to belong to her husband Z, and to be such \nproperty as she has not authority from Z to give. If A takes the property dishonestly, he commits theft. \n(p) A, in good faith, believing property belonging to Z to be A's own property, takes that property out of B's possession. \nHere, as A does not take dishonestly, he does not commit theft. \n379. Punishment for theft .—Whoever commits theft shall be punished with imprisonment of either \ndescription for a term which may extend to three years, or with fine, or with both. \nSTATE AMENDMENT \nGujarat.— \nIn the Indian Penal Code, 1860 (XLV of 1860), after section 379, the following sections shall be \ninserted, namely:— \n379A. Snatching.—(1) Whoever, with the intention to commit theft, suddenly or quickly or forcibly  \nseizes or secures or grabs or takes away fromany person or from his physical possession any moveable \nproperty, and makes or attempt to make escape with such property, is said to commit snatching. \n (2) Whoever attempts to commit snatching shall be punished with rigoro us imprisonment for a \nterm which shall  not  be less than  five years but which may extend to t en years, and with fine which \nmay extend to twenty-five thousand rupees. \n(3) Whoever commits snatching shall be punished with rigorous imprisonment for a term  which \nshall not be less than seven years but which may extend to ten years, and with fine whi ch may extend \nto twenty-five thousand rupees. \n96 \n \n(4) Whoever, after committing or attempting to commit snatching, causes hurt or wrongful restraint \nof fear of hurt, in order to effect his escape shal l be punished with rigorous imprisonment for a term \nwhich may extend to three years, in addition to the punishment provided for the offence of snatching \nby the preceding sub-sections. \n379B.Snatching after preparation made for causing death, hurt or restraint in order to the \ncommitting of snatching.—Whoever commits or attempts to commit snatching, having made preparation \nfor causing death, or hurt, or restraint, or fear of death, or of hurt, or of restraint, to any person, in order to \nthe committing of such snatching, or in order to the retaining of property taken by such snatching, shall be \npunished with rigorous imprisonment for a term which shall not be less than seven year s but which may \nextend to ten years, and with fine which may extend to twenty-five thousand rupees. \n[Vide Gujarat Act 6 of 2019, s. 2] \n380. Theft in dwelling house, etc .—Whoever commits theft in any building, tent or vessel, which \nbuilding, tent or vessel is used as a human dwelling, or used for the custody of property, shall be punished \nwith imprisonment of either description for a term which may extend to se ven years, and shall also be \nliable to fine. \n381. Theft by clerk or servant of property in possession of master .—Whoever, being a clerk or \nservant, or being employed in the capacity of a clerk or servant, commits thef t in respect of any property \nin the possession of his master or employer, shall be punished with imprisonment of either description for \na term which may extend to seven years, and shall also be liable to fine.  \n382. Theft after preparation made for causing death, hurt or restraint in order to the \ncommitting of the theft .—Whoever commits theft, having made preparation for causing death, or hurt, \nor restraint, or fear of death, or of hurt, or of restraint, to any pe rson, in order to the committing of such \ntheft, or in order to the effecting of his escape after the committing of such theft, or in order to the \nretaining of property taken by such theft, shall be punished with rigorous impri sonment for a term which \nmay extend to ten years, and shall also be liable to fine. \n  Illustrations \n(a) A commits theft on property in Z's possession; and while committin g this theft, he has a loaded pistol under his garment \nhaving provided this pistol for the purpose of hurting Z in case Z sh ould resist. A has committed the offence defined in this \nsection. \n(b) A picks Z's pocket, having posted several of his companions near him , in order that they may restrain Z, if Z should \nperceive what is passing and should resist, or should attempt to apprehend A. A has committed the offence defined in this section. \nSTATE AMENDMENT \nTripura \nAfter the section 382 of the Indian Penal Code, the following new sections will be inserted:— \n“382A. Snatching: Whoever commits theft stealthily from a person or through assault or by usi ng \ncriminal force and thereby causes hurt or endangers the life of that person is said to commit the offence of \n‘Snatching’. \n382B. Whoever commits ‘Snatching’ shall be punished with imprisonment for a term which shall not \nbe less than seven years but may extend to a term of ten years or with fine or with both. \n382C. Vehicle lifting: Whoever commits theft of a ‘vehicle’ either from open or close arena, is said \nto commit the offence of ‘vehicle lifting’. \nNote:—The term ‘Vehicle’ shall have the same meaning as defined in sub-section 28 of section 2 of \nMotor Vehicles Act 1988:, \n382D. Whoever commits the offence of ‘vehicle lifting’ shall be punished with imprisonment for a \nterm which shall not be less than seven years but may extend to a term of ten year s or with fine or with \nboth”. \n382E. Cattle lifting: Whoever commits theft of a ‘Cattle’ either from open or close arena, is said to \ncommit the offence of ‘Cattle lifting’. \n97 \n \nNote:- For the purpose of this section, the term ‘Cattle’ means a cow and a calf, whether male or \nfemale, bull, bullock, buffalo-male or female or calf of she-buffalo, whether male or female and an ox or \noxen. \n382F. Whoever commits the offence of ‘Cattle lifting’ shall be punished with imprisonment for a \nterm which shall not be less than seven years but may extend to a term of t em years or with fine or with \nboth.” \n[Vide Tripura Act 4 of 2019, s. 2] \nOf Extortion \n383. Extortion.—Whoever intentionally puts any person in fear of any injury to that person, or to any \nother, and thereby dishonestly induces the person so put in fear to deliver to any person any property, or \nvaluable security or anything signed or sealed which may be converted into a valuable s ecurity, commits \n“extortion”. \nIllustrations \n(a) A threatens to publish a defamatory libel concerning Z unless Z gives him money. He thus induces Z to give him money. \nA has committed extortion. \n(b) A threatens Z that he will keep Z's child in wrongful confinement, unless Z will sign and deliver to A a promissory note \nbinding Z to pay certain monies to A. Z sings and delivers the note. A has committed extortion. \n(c) A threatens to send club-men to plough up Z's field unless Z will sign and deliver to B a bond binding Z under a penalty \nto deliver certain produce to B, and thereby induces Z to sign and deliver the bond. A has committed extortion. \n(d) A, by putting Z in fear of grievous hurt, dishonestly induces Z to  sign or affix his seal to a blank paper and deliver it to \nA. Z sings and delivers the paper to A. Here, as the paper so signe d may be converted into a valuable security. A has committed \nextortion. \n384. Punishment for extortion .—Whoever commits extortion shall be punished with imprisonment \nof either description for a term which may extend to three years, or with fine, or with both. \n385. Putting person in fear of injury in order to commit extortion .—Whoever, in order to the \ncommitting of extortion, puts any person in fear, or attempts to put any person i n fear, of any injury, shall \nbe punished with imprisonment of either description for a term which may extend to t wo years, or with \nfine, or with both. \n386. Extortion by putting a person in fear of death or grievous hurt .—Whoever commits \nextortion by putting any person in fear of death or of grievous hurt to that person or to any other, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine. \n387. Putting person in fear of death or of grievous hurt, in order to commit extortion .—\nWhoever, in order to the committing of extortion, puts or attempts to put any pe rson in fear of death or of \ngrievous hurt to that person or to any other, shall be punished with imprisonment of eit her description for \na term which may extend to seven years, and shall also be liable to fine. \n388. Extortion by threat of accusation of an offence punishable with death or impri sonment for \nlife, etc.—Whoever commits extortion by putting any person in fear of an accusation against th at person \nor any other, of having committed or attempted to commit any offence punishable with death, or with \n1[imprisonment for life], or with imprisonment for a term which may extend t o ten years, or of having \nattempted to induce any other person to commit such offence, shall be punished with imprisonm ent of \neither description for a term which may extend to ten years, and shall also be liable to fine; and, if the \noffence be one punishable under section 377 of this Code, may be punished with 1[imprisonment for life]. \n389. Putting person in fear or accusation of offence, in order to commit extortion .—Whoever, in \norder to the committing of extortion, puts or attempts to put any person in fea r of an accusation, against \nthat person or any other, of having committed, or attempted to commit, an of fence punishable with death \nor with 1[imprisonment for life], or with imprisonment for a term which may extend t o ten years, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine; and, if the offence be punishable under section 377 of this Code, m ay be punished with \n1[imprisonment for life]. \nOf Robbery and dacoity \n390. Robbery.—In all robbery there is either theft or extortion. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n98 \n \nWhen theft is robbery .—Theft is “robbery” if, in order to the committing of the theft, or in \ncommitting the theft, or in carrying away or attempting to carry away propert y obtained by the theft, the \noffender, for that end voluntarily causes or attempts to cause to any person death or hurt or wrongful \nrestraint, or fear of instant death or of instant hurt, or of instant wrongful restraint. \nWhen extortion is robbery .—Extortion is “robbery” if the offender, at the time of committing the \nextortion, is in the presence of the person put in fear, and commits the extortion by put ting that person in \nfear of instant death, of instant hurt, or of instant wrongful restraint to that person or to some other person, \nand, by so putting in fear, induces the person so put in fear then and there to deliver up the thing extorted. \nExplanation.—The offender is said to be present if he is sufficiently near to put t he other person in \nfear of instant death, of instant hurt, or of instant wrongful restraint. \nIllustrations \n(a) A holds Z down, and fraudulently takes Z's money and jewels from Z' s clothes, without Z's consent. Here A has \ncommitted theft, and, in order to the committing of that theft, h as voluntarily caused wrongful restraint to Z. A has therefore \ncommitted robbery. \n(b) A meets Z on the high road, shows a pistol, and demands Z's purse.  Z, in consequence, surrenders his purse. Here A has \nextorted the purse from Z by putting him in fear of instant hurt, and being at the time of committing the extortion in his presence. \nA has therefore committed robbery. \n(c) A meets Z and Z's child on the high road. A takes the child, an d threatens to filing it down a precipice, unless Z delivers \nhis purse. Z, in consequence, delivers his purse. Here A has extorted the purse from Z, by causing Z to be in fear of instant hurt to \nthe child who is there present. A has therefore committed robbery on Z. \n(d) A obtains property from Z by saying “Your child is in the hands of my gang, and will be put to death unless you send us \nten thousand rupees”. This is extortion, and punishable as such: but it is not robbery, unless Z is put in fear of the instant death of \nhis child. \n391. Dacoity.—When five or more persons conjointly commit or attempt to commit a robbery, or  \nwhere the whole number of persons conjointly committing or attempting to commit a robber y, and \npersons present and aiding such commission or attempt, amount to five or more, every person so \ncommitting, attempting or aiding, is said to commit “dacoity”. \n392. Punishment for robbery .—Whoever commits robbery shall be punished with rigorous \nimprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery \nbe committed on the highway between sunset and sunrise, the imprisonment may be extended to four teen \nyears. \n393. Attempt to commit robbery .—Whoever attempts to commit robbery shall be punished with \nrigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine. \n394. Voluntarily causing hurt in committing robbery .—If any person, in committing or in \nattempting to commit robbery, voluntarily causes hurt, such person, and any other person j ointly \nconcerned in committing or attempting to commit such robbery, shall be punish ed with 1[imprisonment \nfor life], or with rigorous imprisonment for a term which may extend to ten year s, and shall also be liable \nto fine. \n395. Punishment for dacoity.—Whoever commits dacoity shall be punished with 1[imprisonment for \nlife], or with rigorous imprisonment for a term which may extend to ten years, a nd shall also be liable to \nfine. \n396. Dacoity with murder .—If any one of five or more persons, who are conjointly committing \ndacoity, commits murder in so committing dacoity, every one of those persons shall  be punished with \ndeath, or 1[imprisonment for life], or rigorous imprisonment for a term which may ext end to ten years, \nand shall also be liable to fine. \n397. Robbery, or dacoity, with attempt to cause death or grievous hurt .—If, at the time of \ncommitting robbery or dacoity, the offender uses any deadly weapon, or causes griev ous hurt to any \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n99 \n \nperson, or attempts to cause death or grievous hurt to any person, the imprison ment with which such \noffender shall be punished shall not be less than seven years. \n398. Attempt to commit robbery or dacoity when armed with deadly weapon .—If, at the time of \nattempting to commit robbery or dacoity, the offender is armed with any deadly weapon, the \nimprisonment with which such offender shall be punished shall not be less than seven years. \n399. Making preparation to commit dacoity .—Whoever makes any preparation for committing \ndacoity, shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall \nalso be liable to fine. \n400. Punishment for belonging to gang of dacoits .—Whoever, at any time after the passing of this \nAct, shall belong to a gang of persons associated for the purpose of habitually com mitting dacoity, shall \nbe punished with 1[imprisonment for life], or with rigorous imprisonment for a term which may extend to \nten years, and shall also be liable to fine. \n401. Punishment for belonging to gang of thieves .—Whoever, at any time after the passing of this \nAct, shall belong to any wandering or other gang of persons associated for the purpose of habitually \ncommitting theft or robbery, and not being a gang of thugs or dacoits, shall be punished with rigorous \nimprisonment for a term which may extend to seven years, and shall also be liable to fine. \n402. Assembling for purpose of committing dacoity .—Whoever, at any time after the passing of \nthis Act, shall be one of five or more persons assembled for the purpose of commit ting dacoity, shall be \npunished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable \nto fine. \nOf criminal misappropriation of property \n403. Dishonest misappropriation of property .—Whoever dishonestly misappropriates or converts \nto his own use any movable property, shall be punished with imprisonment of either des cription for a \nterm which may extend to two years, or with fine, or with both. \nIllustrations \n(a) A takes property belonging to Z out of Z's possession, in good fa ith believingat the time when he takes it, that the \nproperty belongs to himself. A is not guilty of theft; but if A, after discovering his mistake, dishonestly appropriates the property \nto his own use, he is guilty of an offence under this section. \n(b) A, being on friendly terms with Z, goes into Z's library in Z's absence , and takes away a book without Z's express \nconsent. Here, if A was under the impression that he had Z's implied consent to take the book for the purpose of reading it, A has \nnot committed theft. But, if A afterwards sells the book for his own benefit, he is guilty of an offence under this section. \n(c) A and B, being, joint owners of a horse, A takes the horse out of B's possession, intending to use it. Here, as A has a right \nto use the horse, he does not dishonestly misappropriate it. But, if A sell s the horse and appropriates the whole proceeds to his \nown use, he is guilty of an offence under this section. \nExplanation 1.—A dishonest misappropriation for a time only is a misappropriation wi thin the \nmeaning of this section. \nIllustration \nA finds a Government promissory note belonging to Z, bearing a blank endorsement. A, knowing that the note belongs to Z, \npledges it with a banker as a security or a loan, intending at a future time to restore it to Z. A has committed an offence under this \nsection. \nExplanation 2.—A person who finds property not in the possession of any other person, and takes \nsuch property for the purpose of protecting it for, or of restoring it to, the owner, does not take or \nmisappropriate it dishonestly, and is not guilty of an offence; but he is guilty of the offence above defined, \nif he appropriates it to his own use, when he knows or has the means of discovering t he owner, or before \nhe has used reasonable means to discover and give notice to the owner and has kept the property a \nreasonable time to enable the owner to claim it. \nWhat are reasonable means or what is a reasonable time in such a case, is a question of fact. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n \n100 \n \nIt is not necessary that the finder should know who is the owner of the property, or that any particular \nperson is the owner of it; it is sufficient if, at the time of appropriating  it, he does not believe it to be his \nown property, or in good faith believe that the real owner cannot be found. \nIllustrations \n(a) A finds a rupee on the high road, not knowing to whom the rupee belongs, A picks up the rupee. Here A has not \ncommitted the offence defined in this section. \n(b) A finds a letter on the road, containing a bank note. From the direction  and contents of the letter he learns to whom the \nnote belongs. He appropriates the note. He is guilty of an offence under this section. \n(c) A finds a cheque payable to bearer. He can form no conjecture  as to the person who has lost the cheque. But the name of \nthe person, who has drawn the cheque, appears. A knows that this person can direct him to the person in whose favour the cheque \nwas drawn. A appropriates the cheque without attempting to discover the owner. He is guilty of an offence under this section. \n(d) A sees Z drop his purse with money in it. A picks up the purse wit h the intention of restoring it to Z, but afterwards \nappropriates it to his own use. A has committed an offence under this section. \n(e) A finds a purse with money, not knowing to whom it belongs; h e afterwards discovers that it belongs to Z, and \nappropriates it to his own use. A is guilty of an offence under this section. \n(f) A finds a valuable ring, not knowing to whom it belongs. A sells it immediately without attempting to discover the \nowner. A is guilty of an offence under this section. \n404. Dishonest misappropriation of property possessed by deceased person at the time of his \ndeath.—Whoever dishonestly misappropriates or converts to his own use property, knowing t hat such \nproperty was in the possession of a deceased person at the time of that person's decease, and has not since \nbeen in the possession of any person legally entitled to such possession, shall be punished with \nimprisonment of either description for a term which may extend to three years, and shall also be liable to \nfine, and if the offender at the time of such person's decease was employed by him as a clerk or servant, \nthe imprisonment may extend to seven years. \nIllustration \nZ dies in possession of furniture and money. His servant A, before the  money comes into the possession of any person \nentitled to such possession, dishonestly misappropriates it. A has committed the offence defined in this section. \nOf criminal breach of trust \n405. Criminal breach of trust.—Whoever, being in any manner entrusted with property, or with any \ndominion over property, dishonestly misappropriates or converts to his own use t hat property, or \ndishonestly uses or disposes of that property in violation of any direction of l aw prescribing the mode in \nwhich such trust is to be discharged, or of any legal contract, express or impl ied, which he has made \ntouching the discharge of such trust, or wilfully suffers any other person so t o do, commits “criminal \nbreach of trust”. \n1[2[Explanation 1].—A person, being an employer 3[of an establishment whether exempted under"
  },
  {
    "id": "english_sec_17",
    "language": "english",
    "granularity": "section",
    "section": "17",
    "text": "section 17 of the Employees ’ Provident Funds and Miscellaneous Provisions Act, 1952 (19 of 1952) or \nnot] who deducts the employee ’s contribution from the wages payable to the employee for credit to a \nProvident Fund or Family Pension Fund established by any law for the time being in force, shal l be \ndeemed to have been entrusted with the amount of the contribution so deducted by him and if he makes \ndefault in the payment of such contribution to the said Fund in violation of the said law, sha ll be deemed \nto have dishonestly used the amount of the said contribution in violation of a d irection of law as \naforesaid.] \n4[Explanation 2.—A person, being an employer, who deducts the employees ’ contribution from the \nwages payable to the employee for credit to the Employees ’ State Insurance Fund held and administered \nby the Employees ’ State Insurance Corporation established under the Employees ’ State Insurance Act, \n1948 (34 of 1948), shall be deemed to have been entrusted with the amount of the contribution so \ndeducted by him and if he makes default in the payment of such contribution to the said Fund in violation \nof the said Act, shall be deemed to have dishonestly used the amount of the said contribu tion in violation \nof a direction of law as aforesaid.] \nIllustrations \n(a) A, being executor to the will of a deceased person, dishonestly d isobeys the law which directs him to divide the effects \naccording to the will, and appropriates them to his own use. A has committed criminal breach of trust. \n                                                           \n1. Ins. by Act 40 of 1973, s. 9 (w.e.f. 1-11-1973). \n2. Explanation numbered as Explanation 1 by Act 38 of 1975, s. 9 (w.e.f. 1-9-1975). \n3. Ins. by Act 33 of 1988, s. 27 (w.e.f. 1-8-1988). \n4. Ins. by Act 38 of 1975, s. 9 (w.e.f. 1-9-1975). \n101 \n \n(b) A is a warehouse-keeper. Z going on a journey, entrusts his furniture  to A, under a contract that it shall be returned on \npayment of a stipulated sum for warehouse room. A dishonestly sells the goods. A has committed criminal breach of trust. \n(c) A, residing in Calcutta, is agent for Z, residing at Delhi. There is an express or implied contract between A and Z, that all \nsums remitted by Z to A shall be invested by A, according to Z's direc tion. Z remits a lakh of rupees to A, with directions to A to \ninvest the same in Company's paper. A dishonestly disobeys the directions  and employs the money in his own business. A has \ncommitted criminal breach of trust. \n(d) But if A, in the last illustration, not dishonestly but in good faith , believing that it will be more for Z's advantage to hold \nshares in the Bank of Bengal, disobeys Z's directions, and buys shares in the Bank of Bengal, for Z, instead of buying Company's \npaper, here, thought Z should suffer loss, and should be entitled  to bring a civil action against A, on account of that loss, ye t A, \nnot having acted dishonestly, has not committed criminal breach of trust. \n(e) A, a revenue-officer, is entrusted with public money and is eithe r directed by law, or bound by a contract, express or \nimplied, with the Government, to pay into a certain treasury all the p ublic money which he holds. A dishonestly appropriates the \nmoney. A has committed criminal breach of trust. \n(f) A, a carrier, is entrusted by Z with property to be carried by land or by water. A dishonestly misappropriates the property. \nA has committed criminal breach of trust. \n406. Punishment for criminal breach of trust.—Whoever commits criminal breach of trust shall be \npunished with imprisonment of either description for a term which may extend to  three years, or with \nfine, or with both. \n407. Criminal breach of trust by carrier, etc.—Whoever, being entrusted with property as a carrier, \nwharfinger or warehouse-keeper, commits criminal breach of trust in respect of such property, shall be \npunished with imprisonment of either description for a term which may extend to seven years, and shall \nalso be liable to fine. \n408. Criminal breach of trust by clerk or servant.—Whoever, being a clerk or servant or employed \nas a clerk or servant, and being in any manner entrusted in such capacity with proper ty, or with any \ndominion over property, commits criminal breach of trust in respect of that property, shall be punished \nwith imprisonment of either description for a term which may extend to se ven years, and shall also be \nliable to fine. \n409. Criminal breach of trust by public servant, or by banker, merchant or agent .—Whoever, \nbeing in any manner entrusted with property, or with any dominion over propert y in his capacity of a \npublic servant or in the way of his business as a banker, merchant, factor, broker, at torney or agent, \ncommits criminal breach of trust in respect of that property, shall be pun ished with 1[imprisonment for \nlife], or with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine. \nOf the receiving of stolen property \n410. Stolen property .—Property, the possession whereof has been transferred by theft, or by \nextortion, or by robbery, and property which has been criminally misappropriated or in respect of which \n2***3***criminal breach of trust has been committed, is designated as “stolen property”, 4[whether the \ntransfer has been made, or the misappropriation or breach of trust has bee n committed, within or without \n5[India]]. But, if such property subsequently comes into the possession of a person leg ally entitled to the \npossession thereof, it then ceases to be stolen property. \n411. Dishonestly receiving stolen property .—Whoever dishonestly receives or retains any stolen \nproperty, knowing or having reason to believe the same to be stolen property, shall be pun ished with \nimprisonment of either description for a term which may extend to three years, or with fine, or with both. \n412. Dishonestly receiving property stolen in the commission of a dacoity.—Whoever dishonestly \nreceives or retains any stolen property, the possession whereof he knows or has reason to believe to have \nbeen transferred by the commission of dacoity, or dishonestly receives from a person, w hom he knows or \nhas reason to believe to belong or to have belonged to a gang of dacoits, property which h e knows or has \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. The word “the” rep by Act 12 of 1891, s. 2 and the First Sch. \n3. The words “offence of” rep. by Act 8 of1882, s. 9. \n4. Ins. by s. 9, ibid. \n5. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch., \nto read as above (w.e.f. 1-4-1951). \n102 \n \nreason to believe to have been stolen, shall be punished with 1[imprisonment for life], or with rigorous \nimprisonment for a term which may extend to ten years, and shall also be liable to fine.  \n413. Habitually dealing in stolen property. —Whoever habitually receives or deals in property \nwhich he knows or has reason to believe to be stolen property, shall be punished w ith 1[imprisonment for \nlife], or with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine. \n414. Assisting in concealment of stolen property .—Whoever voluntarily assists in concealing or \ndisposing of or making away with property which he knows or has reason to believe to be stolen property, \nshall be punished with imprisonment of either description for a term which may  extend to three years, or \nwith fine, or with both. \nOf Cheating \n415. Cheating.—Whoever, by deceiving any person, fraudulently or dishonestly induces the person \nso deceived to deliver any property to any person, or to consent that any person shall reta in any property, \nor intentionally induces the person so deceived to do or omit to do anything which  he would not do or \nomit if he were not so deceived, and which act or omission causes or is likely to ca use damage or harm to \nthat person in body, mind, reputation or property, is said to “cheat”. \nExplanation.—A dishonest concealment of facts is a deception within the meaning of this section. \nIllustrations \n(a) A, by falsely pretending to be in the Civil Service, intentionally de ceives Z, and thus dishonestly induces Z to let him \nhave on credit goods for which he does not mean to pay. A cheats. \n(b) A, by putting a counterfeit mark on an article, intentionally deceives Z into a belief that this article was made by a certain \ncelebrated manufacturer, and thus dishonestly induces Z to buy and pay for the article. A cheats. \n(c) A, by exhibiting to Z a false sample of an article intentionally dec eives Z into believing that the article corresponds with \nthe sample, and thereby dishonestly induces Z to buy and pay for the article. A cheats. \n(d) A, by tendering in payment for an article a bill on a house with w hich A keeps no money, and by which A expects that \nthe bill will be dishonoured, intentionally deceives Z, and thereby  dishonestly induces Z to deliver the article, intending not to \npay for it. A cheats. \n(e) A, by pledging as diamond articles which he knows are not diamond s, intentionally deceives Z, and thereby dishonestly \ninduces Z to lend money. A cheats. \n(f) A Intentionally deceives Z into a belief that A means to repay an y money that Z may lend to him and thereby dishonestly \ninduces Z to lend him money, A not intending to repay it. A cheats. \n(g) A intentionally deceives Z into a belief that A means to deliver to Z a certain quantity of indigo plant which he does not \nintend to deliver, and thereby dishonestly induces Z to advance mone y upon the faith of such delivery. A cheats; but if A, at the  \ntime of obtaining the money, intends to deliver the indigo plant, a nd afterwards breaks his contract and does not deliver it, he \ndoes not cheat, but is liable only to a civil action for breach of contract. \n(h) A intentionally deceives Z into a belief that A has performed A's  part of a contract made with Z, which he has not \nperformed, and thereby dishonestly induces Z to pay money. A cheats. \n(i) A sells and conveys an estate to B. A, knowing that in consequenc e of such sale he has no right to the property, sells or \nmortgages the same to Z, without disclosing the fact of the previou s sale and conveyance to B, and receives the purchase or \nmortgage money from Z. A cheats. \n416. Cheating by personation. —A person is said to “cheat by personation ” if he cheats by \npretending to be some other person, or by knowingly substituting one person for or anothe r, or \nrepresenting that he or any other person is a person other than he or such other person really is. \nExplanation.—The offence is committed whether the individual personated is a real or imaginary \nperson. \nIllustrations \n(a) A cheats by pretending to be a certain rich banker of the same name. A cheats by personation. \n(b) A cheats by pretending to be B, a person who is deceased. A cheats by personation. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n103 \n \n417. Punishment for cheating .—Whoever cheats shall be punished with imprisonment of either \ndescription for a term which may extend to one year, or with fine, or with both. \n418. Cheating with knowledge that wrongful loss may ensue to person whose interest offender is \nbound to protect.—Whoever cheats with the knowledge that he is likely thereby to cause wr ongful loss \nto a person whose interest in the transaction to which the cheating relates, he was bound, either by law, or \nby a legal contract, to protect, shall be punished with imprisonment of either descripti on for a term which \nmay extend to three years, or with fine, or with both. \n419. Punishment for cheating by personation .—Whoever cheats by personation shall be punished \nwith imprisonment of either description for a term which may extend to three y ears, or with fine, or with \nboth. \n420. Cheating and dishonestly inducing delivery of property .—Whoever cheats and thereby \ndishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy \nthe whole or any part of a valuable security, or anything which is signed or sea led, and which is capable \nof being converted into a valuable security, shall be punished with imprisonment of either description for \na term which may extend to seven years, and shall also be liable to fine. \nOf fraudulent feeds and dispositions of property \n421. Dishonest or fraudulent removal or concealment of property to prevent distribution among \ncreditors.—Whoever dishonestly or fraudulently removes, conceals or delivers to any person, or transfers \nor causes to be transferred to any person, without adequate consideration, any property, intending thereby \nto prevent, or knowing it to be likely that he will thereby prevent, the distri bution of that property \naccording to law among his creditors or the creditors of any other person, shall be punished with \nimprisonment of either description for a term which may extend to two years, or with fine, or with both. \n422. Dishonestly or fraudulently preventing debt being available for creditors .—Whoever \ndishonestly or fraudulently prevents any debt or demand due to himself or to any other person from being \nmade available according to law for payment of his debts or the debts of such other per son, shall be \npunished with imprisonment of either description for a term which may extend to two years, or with fine, \nor with both. \n423. Dishonest or fraudulent execution of deed of transfer containing false statement o f \nconsideration.—Whoever dishonestly or fraudulently signs, executes or becomes a party to any deed o r \ninstrument which purports to transfer or subject to any charge any property, or  any interest therein, and \nwhich contains any false statement relating to the consideration for such transfe r or charge, or relating t o \nthe person or persons for whose use or benefit it is really intended to operat e, shall be punished with \nimprisonment of either description for a term which may extend to two years, or with fine, or with both. \n424. Dishonest or fraudulent removal or concealment of property .—Whoever dishonestly or \nfraudulently conceals or removes any property of himself or any other person, or dishonestl y or \nfraudulently assists in the concealment or removal thereof, or dishonestly releases any demand or claim to \nwhich he is entitled, shall be punished with imprisonment of either description for a t erm which may \nextend to two years, or with fine, or with both. \nOf mischief \n425. Mischief.—Whoever with intent to cause, or knowing that he is likely to cause, wrongful loss or \ndamage to the public or to any person, causes the destruction of any property, or any such chang e in any \nproperty or in the situation thereof as destroys or diminishes its value or utility, or affects it injuriously, \ncommits “mischief”. \nExplanation 1.—It is not essential to the offence of mischief that the offender should i ntend to cause \nloss or damage to the owner of the property injured or destroyed. It is sufficien t if he intends to cause, or \nknows that he is likely to cause, wrongful loss or damage to any person by injuring any property, whether \nit belongs to that person or not. \nExplanation 2.—Mischief may be committed by an act affecting property belonging to the pe rson \nwho commits the act, or to that person and others jointly. \n  \n104 \n \nIllustrations \n(a) A voluntarily burns a valuable security belonging to Z intending to cause wrongful loss to Z. A has committed mischief. \n(b) A introduces water in to an ice-house belonging to Z and thus causes the ice to melt, intending wrongful loss to Z. A has \ncommitted mischief. \n(c) A voluntarily throws into a river a ring belonging to Z, with the intention  of thereby causing wrongful loss to Z. A has \ncommitted mischief. \n(d) A, knowing that his effects are about to be taken in executio n in order to satisfy a debt due from him to Z, destroys those \neffects, with the intention of thereby preventing Z from obtaining satisfaction of the debt, and of thus causing damage to Z. A ha s \ncommitted mischief. \n(e) A having insured a ship, voluntarily causes the same to be cast away , with the intention of causing damage to the \nunderwriters. A has committed mischief. \n(f) A causes a ship to be cast away, intending thereby to cause dama ge to Z who has lent money on bottomry on the ship. A \nhas committed mischief. \n(g) A, having joint property with Z in a horse, shoots the horse, inten ding thereby to cause wrongful loss to Z. A has \ncommitted mischief. \n(h) A causes cattle to enter upon a field belonging to Z, intending to ca use and knowing that he is likely to cause damage to \nZ's crop. A has committed mischief. \n426. Punishment for mischief.—Whoever commits mischief shall be punished with imprisonment of \neither description for a term which may extend to three months, or with fine, or with both. \n427. Mischief causing damage to the amount of fifty rupees .—Whoever commits mischief and \nthereby causes loss or damage to the amount of fifty rupees or upwards, shall be punishe d with \nimprisonment of either description for a term which may extend to two years, or with fine, or with both.  \n428. Mischief by killing or maiming animal of the value of ten rupees .—Whoever commits \nmischief by killing, poisoning, maiming or rendering useless any animal or animals of the value of the ten \nrupees or upwards, shall be punished with imprisonment of either description for a term which may \nextend to two years, or with fine, or with both. \n429. Mischief by killing or maiming cattle, etc., of any value or any animal of t he value of fifty \nrupees.—Whoever commits mischief by killing, poisoning, maiming or rendering useless, any elephant, \ncamel, horse, mule, buffalo, bull, cow or ox, whatever may be the value thereof, or any ot her animal of \nthe value of fifty rupees or upwards, shall be punished with imprisonment of  either description for a term \nwhich may extend to five years, or with fine, or with both. \n430. Mischief by injury to works of irrigation or by wrongfully diverting water .—Whoever \ncommits mischief by doing any act which causes, or which he knows to be likely to cause , a diminution \nof the supply of water for agricultural purposes, or for food or drink f or human beings or for animals \nwhich are property, or for cleanliness or for carrying on any manufacture, shall  be punished with \nimprisonment of either description for a term which may extend to five years, or with fine, or with both. \n431. Mischief by injury to public road, bridge, river or channel .—Whoever commits mischief by \ndoing any act which renders or which he knows to be likely to render any public road, bridge, navigable \nriver or navigable channel, natural or artificial, impassable or less s afe for travelling or conveying \nproperty, shall be punished with imprisonment of either description for a term whi ch may extend to five \nyears, or with fine, or with both. \n432. Mischief by causing inundation or obstruction to public drainage attended with damage.—\nWhoever commits mischief by doing any act which causes or which he knows to be likel y to cause an \ninundation or an obstruction to any public drainage attended with injury or damage, shall  be punished \nwith imprisonment of either description for a term which may extend to five y ears, or with fine, or with \nboth. \n433. Mischief by destroying, moving or rendering less useful a light-house or sea-mark .—\nWhoever commits mischief by destroying or moving any light-house or other li ght used as a sea-mark, or \nany sea-mark or buoy or other thing placed as a guide for navigators, or by any act  which renders any \nsuch light-house, sea-mark, buoy or other such thing as aforesaid less useful as a guide for navigators, \nshall be punished with imprisonment of either description for a term which may extend to seven years, or \nwith fine, or with both. \n105 \n \n434. Mischief by destroying or moving, etc., a land-mark fixed by public authority .—Whoever \ncommits mischief by destroying or moving any land-mark fixed by the authority of a public servant, or by \nany act which renders such land-mark less useful as such, shall be punished with imprisonment of either \ndescription for a term which may extend to one year, or with fine, or with both. \n435. Mischief by fire or explosive substance with intent to cause damage to amount of one \nhundred or (in case of agricultural produce) ten rupees .—Whoever commits mischief by fire or any \nexplosive substance intending to cause, or knowing it to be likely that he will thereby cause, damage to \nany property to the amount of one hundred rupees or upwards 1[or (where the property is agricultural \nproduce) ten rupees or upwards], shall be punished with imprisonment of either descripti on for a term \nwhich may extend to seven years and shall also be liable to fine. \n436. Mischief by fire or explosive substance with intent to destroy house, etc.—Whoever commits \nmischief by fire or any explosive substance, intending to cause, or knowing it to be li kely that he will \nthereby cause, the destruction of any building which is ordinarily used as a place of worship or as a \nhuman dwelling or as a place for the custody of property, shall be punished wi th 2[imprisonment for life], \nor with imprisonment of either description for a term which may extend to ten years, and shall also be \nliable to fine. \n437. Mischief with intent to destroy or make unsafe a decked vessel or one of twenty t ons \nburden.—Whoever commits mischief to any decked vessel or any vessel of a burden of twenty tons or \nupwards, intending to destroy or render unsafe, or knowing it to be likely that he will thereby destroy or \nrender unsafe, that vessel, shall be punished with imprisonment of either description for a term which may \nextend to ten years, and shall also be liable to fine. \n438. Punishment for the mischief described in section 437 committed by fire or explosiv e \nsubstance. —Whoever commits, or attempts to commit, by fire or any explosive substance, such mischief \nas is described in the last preceding section, shall be punished with 2[imprisonment for life], or with \nimprisonment of either description for a term which may extend to ten years, and shall also be liable to \nfine. \n439. Punishment for intentionally running vessel aground or ashore with intent to commit theft, \netc.—Whoever intentionally runs any vessel aground or ashore, intending to commit theft of any property \ncontained therein or to dishonestly misappropriate any such property, or with intent that such theft or \nmisappropriation of property may be committed, shall be punished with imprisonment  of either \ndescription for a term which may extend to ten years, and shall also be liable to fine. \n440. Mischief committed after preparation made for causing death or hurt .—Whoever commits \nmischief, having made preparation for causing to any person death, or hurt, or wrongful restraint, or fear \nof death, or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for \na term which may extend to five years, and shall also be liable to fine. \nOf criminal trespass \n441. Criminal trespass .—Whoever enters into or upon property in the possession of another with \nintent to commit an offence or to intimidate, insult or annoy any person in possession of such property,  \nor having lawfully entered into or upon such property, unlawfully remains there with intent thereby to \nintimidate, insult or annoy any such person, or with intent to commit an offence,  \nis said to commit “criminal trespass”. \nSTATE AMENDMENT \nOrissa \nAmendment of section 441 .-In the Indian Penal Code, 1860 (45 of 1860), for section 441, the \nfollowing section shall be substituted, namely:— \n“441.Criminal trespass .-Whoever enters into or upon property in possession of another with \nintent to commit an offence or to intimidate, insult or annoy any person in posse ssion of such \nproperty, \n                                                           \n1. Ins. by Act 8 of 1882, s. 10 \n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation forlife” (w.e.f. 1-1-1956). \n106 \n \n   Or having lawfully entered into or upon such property, unlawfully remains there wi th intent \nthereby to intimidate, insult or annoy any such person or with intent to commit an offence. \n   Or having lawfully entered into or upon such property, remains there with the intent ion of \ntaking unauthorized possession or making unauthorized use of such property and fails t o withdraw \nfrom such property or its possession or use, when called upon to do so by that another person by \nnotice in writing, duly served  on him, \nIs said to commit criminal trespass.” \n[Vide Orissa Act 22 of 1986, s. 2] \n442. House-trespass .—Whoever commits criminal trespass by entering into or remaining in any \nbuilding, tent or vessel used as a human dwelling or any building used as a place for w orship, or as a \nplace for the custody of property, is said to commit “house-trespass”. \nExplanation.—The introduction of any part of the criminal trespasser's body is entering suffici ent to \nconstitute house-trespass. \n443. Lurking house-trespass .—Whoever commits house-trespass having taken precautions to \nconceal such house-trespass from some person who has a right to exclude or eject the tr espasser from the \nbuilding, tent or vessel which is the subject of the trespass, is said to commit “lurking house-trespass”. \n444. Lurking house-trespass by night .—Whoever commits lurking house-trespass after sunset and \nbefore sunrise, is said to commit “lurking house-trespass by night”. \n445. House-breaking.—A person is said to commit “house-breaking” who commits house-trespass if \nhe effects his entrance into the house or any part of it in any of the six ways hereinafter described; or if, \nbeing in the house or any part of it for the purpose of committing an offence, or  having committed an \noffence therein, he quits the house or any part of it in any of such six ways, that is to say:— \nFirst.—If he enters or quits through a passage made by himself, or by any abettor of the ho use-\ntrespass, in order to the committing of the house-trespass. \nSecondly.—If he enters or quits through any passage not intended by any person, other than himsel f \nor an abettor of the offence, for human entrance; or through any passage to which he has  obtained access \nby scaling or climbing over any wall or building. \nThirdly.—If he enters or quits through any passage which he or any abettor of the house-trespas s has \nopened, in order to the committing of the house-trespass by any means by which that passag e was not \nintended by the occupier of the house to be opened. \nFourthly.—If he enters or quits by opening any lock in order to the committing of the house-tr espass, \nor in order to the quitting of the house after a house-trespass. \nFifthly.—If he effects his entrance or departure by using criminal force or committing  an assault, or \nby threatening any person with assault. \nSixthly.—If he enters or quits by any passage which he knows to have been fastened against such  \nentrance or departure, and to have been unfastened by himself or by an abettor of the house-trespass. \nExplanation.—Any out-house or building occupied with a house, and between which and such house \nthere is an immediate internal communication, is part of the house within the meaning of this section. \nIllustrations \n(a) A commits house-trespass by making a hole through the wall of Z's  house, and putting his hand through the aperture. \nThis is house-breaking. \n(b) A commits house-trespass by creeping into a ship at a port-hole between decks. This is house-breaking. \n(c) A commits house-trespass by entering Z's house through a window. This is house-breaking. \n(d) A commits house-trespass by entering Z's house through the door, ha ving opened a door which was fastened. This is \nhouse-breaking. \n(e) A commits house-trespass by entering Z's house through the door, ha ving lifted a latch by putting a wire through a hole \nin the door. This is house-breaking. \n107 \n \n(f) A finds the key of Z's house door, which Z had lost, and commit s house-trespass by entering Z's house, having opened \nthe door with that key. This is house-breaking. \n(g) Z is standing in his doorway. A forces a passage by knocking Z do wn, and commits house-trespass by entering the \nhouse. This is house-breaking. \n(h) Z, the door-keeper of Y, is standing in Y's doorway. A commits h ouse-trespass by entering the house, having deterred Z \nfrom opposing him by threatening to beat him. This is house-breaking. \n446. House-breaking by night .—Whoever commits house-breaking after sunset and before sunrise, \nis said to commit “house-breaking by night”. \n447. Punishment for criminal trespass .—Whoever commits criminal trespass shall be punished \nwith imprisonment of either description for a term which may extend to three months, or  with fine which \nmay extend to five hundred rupees, or with both. \n448. Punishment for house-trespass .—Whoever commits house-trespass shall be punished with \nimprisonment of either description for a term which may extend to one year, or with fine which may \nextend to one thousand rupees, or with both. \n449. House-trespass in order to commit offence punishable with death .—Whoever commits \nhouse-trespass in order to the committing of any offence punishable with death,  shall be punished with \n1[imprisonment for life], or with rigorous imprisonment for a term not exceeding ten years, and shall also \nbe liable to fine. \n450. House-trespass in order to commit offence punishable with imprisonment for li fe.—\nWhoever commits house-trespass in order to the committing of any offence punish able with \n1[imprisonment for life], shall be punished with imprisonment of either description for a term not \nexceeding ten years, and shall also be liable to fine. \n451. House-trespass in order to commit offence punishable with imprisonment .—Whoever \ncommits house-trespass in order to the committing of any offence punishable with imprisonment, shall be \npunished with imprisonment of either description for a term which may extend t o two years, and shall \nalso be liable to fine; and if the offence intended to be committed is theft, the term of the imprisonment \nmay be extended to seven years. \n452. House-trespass alter preparation for hurt, assault or wrongful restraint .—Whoever \ncommits house-trespass, having made preparation for causing hurt to any person or for  assaulting any \nperson, or for wrongfully restraining any person, or for putting and person in fear of hurt, or of assault, or \nof wrongful restraint, shall be punished with imprisonment of either description f or a term which may \nextend to seven years, and shall also be liable to fine. \n453. Punishment for lurking house-trespass or house-breaking .—Whoever commits lurking \nhouse-trespass or house-breaking, shall be punished with imprisonment of either descr iption for a term \nwhich may extend to two years, and shall also be liable to fine. \n454. Lurking house-trespass or house-breaking in order to commit offence punishable with \nimprisonment.—Whoever commits lurking house-trespass or house-breaking, in order to the committing \nof any offence punishable with imprisonment, shall be punished with imprisonment of eith er description \nfor a term which may extend to three years, and shall also be liable to fine; and if  the offence intended to \nbe committed is theft, the term of the imprisonment may be extended to ten years. \n455. Lurking house-trespass or house-breaking after preparation for hurt, assault or wrongful \nrestraint.—Whoever commits lurking hou se-trespass, or house-breaking, having made preparation for \ncausing hurt to any person, or for assaulting any person, or for wrongfully restraining any person, or for \nputting any person in fear of hurt or of assault or of wrongful restraint, shal l be punished with \nimprisonment of either description or a term which may extend to ten years, a nd shall also be liable to \nfine. \n456. Punishment for lurking house-trespass or house-breaking by night .—Whoever commits \nlurking hou se-trespass by night, or house-breaking by night, shall be punished with impr isonment of \neither description for a term which may extend to three years, and shall also be liable to fine. \n457. Lurking house-trespass or house-breaking by night in order to commit offence punishable \nwith imprisonment.—Whoever commits lurking house-trespass by night, or house-breaking by night, in \norder to the committing of any offence punishable with imprisonment, shall be punished w ith \nimprisonment of either description for a term which may extend to five years, and shall also be liable to \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n108 \n \nfine; and, if the offence intended to be committed is theft, the term of the impr isonment may be extended \nto fourteen years. \n458. Lurking house-trespass or house-breaking by night after preparation for hurt, assault, or \nwrongful restraint .—Whoever commits lurking house-trespass by night, or house-breaking by night, \nhaving made preparation for causing hurt to any person or for assaulting any person, or for wrongfully \nrestraining any person, or for putting any person in fear of hurt, or of assaul t, or of wrongful restraint, \nshall be punished with imprisonment of either description for a term which may  extend to fourteen years, \nand shall also be liable to fine. \n459. Grievous hurt caused whilst committing lurking house-trespass or house-breaking .—\nWhoever, whilst committing lurking house-trespass or house-breaking, causes grievous hurt to any person \nor attempts to cause death or grievous hurt to any person, shall be punished with 1[imprisonment for life], \nor imprisonment of either description for a term which may extend to ten years, and shall also be liable to \nfine. \n460. All persons jointly concerned in lurking house-trespass or house-breaking by night \npunishable where death or grievous hurt caused by one of them .—If, at the time of the committing of \nlurking house-trespass by night or house-breaking by night, any person guilty of such offence shall \nvoluntarily cause or attempt to cause death or grievous hurt to any person, every p erson jointly concerned \nin committing such lurkking house-trespass by night or house-breaking by night , shall be punished with \n1[imprisonment for life], or with imprisonment of either description for a ter m which may extend to ten \nyears, and shall also be liable to fine.  \n461. Dishonestly breaking open receptacle containing property .—Whoever dishonestly or with \nintent to commit mischief, breaks open or unfastens any closed receptacle which contains or which he \nbelieves to contain property, shall be punished with imprisonment of either descri ption for a term which \nmay extend to two years, or with fine, or with both. \n462. Punishment for same offence when committed by person entrusted with custody .—\nWhoever, being entrusted with any closed receptacle which contains or which he believes to  contain \nproperty, without having authority to open the same, dishonestly, or with inten t to commit mischief, \nbreaks open or unfastens that receptacle, shall be punished with imprisonment of either description for a \nterm which may extend to three years, or with fine, or with both. \nCHAPTER XVIII \nOF OFFENCES RELATING TO DOCUMENTSAND TO2*** PROPERTY MARKS \n463. Forgery .—3[Whoever makes any false document or false electronic record or part of a \ndocument or electronic record, with intent to cause damage or injury], to the public or to any person, or to \nsupport any claim or title, or to cause any person to part with property, or to ent er into any express or \nimplied contract, or with intent to commit fraud or that fraud may be committed, commits forgery. \n464. Making a false document .—3[A person is said to make a false document or false electronic \nrecord— \nFirst.—Who dishonestly or fraudulently— \n(a) makes, signs, seals or executes a document or part of a document; \n(b) makes or transmits any electronic record or part of any electronic record; \n(c) affixes any 4[electronic signature] on any electronic record; \n(d) makes any mark denoting the execution of a document or the authenticity of t he \n4[electronic signature], \nwith the intention of causing it to be believed that such document or part of docum ent, electronic \nrecord or 4[electronic signature] was made, signed, sealed, executed, transmitted or affixed by or by the \nauthority of a person by whom or by whose authority he knows that it was not made , singed, sealed, \nexecuted or affixed; or \nSecondly.—Who without lawful authority, dishonestly or fraudulently, by cancellation or otherwise, alters a document or an \nelectronic record in any material part thereof, after it has been made, executed or affixed with 4[electronic signature] either by \nhimself or by any other person, whether such person be living or dead at the time of such alteration; or \nThirdly.—Who dishonestly or fraudulently causes any person to sign, seal, ex ecute or alter a document or an electronic \nrecord or to affix his 4[electronic signature] on any electronic record knowing that such person by reason of unsoundness of mind \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. The words “TRADE OR” omitted by Act 43 of 1958, s. 135 and Sch. (w.e.f. 25-11-1959). \n3. Subs. by Act 21 of 2000, s. 91 and the First Sch., for certain words (w.e.f. 17-10-2000). \n4. Subs. by Act 10 of 2009, s. 51, for “digital signature” (w.e.f. 27-10-2009). \n109 \n \nor intoxication cannot, or that by reason of deception practised upon him, he does not know the contents of the document or \nelectronic record or the nature of the alteration.] \nIllustrations \n(a) A has a letter of credit upon B for rupees 10,000, written by Z. A, in order to defraud B, adds cipher to the 10,000, and makes the sum \n1,00,000 intending that it may be believed by B that Z so wrote the letter. A has committed forgery.  \n(b) A, without Z's authority, affixes Z's seal to a document  purporting to be a conveyance of an estate from Z to  A, with the intention of \nselling the estate to B and thereby of obtaining from B the purchase-money. A has committed forgery. \n(c) A picks up a cheque on a banker signed by B, payable to bearer, but without any sum having been inserted in the cheque. A fraudulently \nfills up the cheque by inserting the sum of ten thousand rupees. A commits forgery. \n(d) A leaves with B, his agent, a cheque on a banker, s igned by A, without inserting the sum payable and aut horizes B to fill up the cheque \nby inserting a sum not exceeding ten thousand rupees for the purpose of making certain payments. B fraudulently fills up the cheque by inserting \nthe sum of twenty thousand rupees. B commits forgery. \n(e) A draws a bill of exchange on himself in the name of B without B's authority, intending to discount it as a genuine bill with a banker and \nintending to take up the bill on its maturity. Here, as A draws the bill with intent to deceive the banker  by leading him to suppose that he had the \nsecurity of B, and thereby to discount the bill, A is guilty of forgery. \n(f) Z's will contains these words—“I direct that all my remaining property be equally divided between A, B and C.” A dishonestly scratches \nout B's name, intending that it may be believed that the whole was left to himself and C. A has committed forgery. \n(g) A endorses a Government promissory note and makes it payable to Z or his order by writing on the bill the words “Pay to Z or his order” \nand signing the endorsement. B dishonestly erases the wor ds “Pay to Z or his order ”, and thereby converts the special endorsement into a b lank \nendorsement. B commits forgery. \n(h) A sells and conveys an estate to Z. A afterwards, in order to defraud Z of his estate, executes a conveyance of the same estate to B, dated \nsix months earlier than the date of the conveyance to Z, intending it to be believed that he had conveyed  the estate to B before he conveyed it to \nZ. A has committed forgery. \n(i) Z dictates his will to A. A intentionally writes dow n a different legatee named by Z, and by representing  to Z that he has prepared the \nwill according to his instructions, induces Z to sign the will. A has committed forgery. \n(j) A writes a letter and signs it with B's name without B's authority, certifying that A is a man of good characte r and in distressed \ncircumstances from unforeseen misfortune, intending by means of such letter to obtain alms from Z and other persons. H ere, as A made a false \ndocument in order to induce Z to part with property, A has committed forgery. \n(k) A without B's authority writes a letter and signs it in B's name certifying to A's character, intending thereby to obtain employment under \nZ. A has committed forgery inasmuch as he intended to d eceive Z by the forged certificate, and thereby to induce Z to enter into an express o r \nimplied contract for service. \nExplanation 1.—A man’s signature of his own name may amount to forgery. \nIllustrations \n(a) A signs his own name to a bill of exchange, intending  that it may be believed that the bill was drawn by an other person of the same \nname. A has committed forgery. \n(b) A writes the word “accepted” on a piece of paper and signs it with Z's name, in orde r that B may afterwards write on the paper a bill of \nexchange drawn by B upon Z, and negotiate the bill as though it had been accepted by Z. A is guilty of forgery; and if B, knowing the fact, draws \nthe bill upon the paper pursuant to A's intention, B is also guilty of forgery. \n(c) A picks up a bill of exchange payable to the order of a different person of the same name. A endorses the bill in his own name, intending \nto cause it to be believed that it was endorsed by the person to whose order it was payable; here A has committed forgery. \n(d) A purchases an estate sold under execution of a decre e against B. B, after the seizure of the estate, in co llusion with Z, executes a lease \nof the estate, to Z at a nominal rent and for a long period and dates the lease six months prior to the seizure, with intent to defraud A, and to cause \nit to be believed that the lease was granted before the seizure. B, though he executes the lease in his own name, commits forgery by antedating it. \n(e) A, a trader, in anticipation of insolvency, lodges effects with B for A's benefit, and with intent to de fraud his creditors; and in order to \ngive a colour to the transaction, writes a promissory no te binding himself to pay to B a sum for value receive d, and antedates the note, intending \nthat it may be believed to have been made before A was on the point of insolvency. A has committed forgery un der the first head of the \ndefinition. \nExplanation 2.—The making of a false document in the name of a fictiou s person, intending it to be believed that the docume nt was made \nby a real person, or in the name of a deceased person, in tending it to be believed that the document was made by  the person in his lifetime, may \namount to forgery. \nIllustration \nA draws a bill of exchange upon a fictious person, and  fraudulently accepts the bill in the name of such fi ctitious person with intent to negotiate \nit. A commits forgery. \n1[Explanation 3.—For the purposes of this section, the expression “affixing 2[electronic signature]” shall have the meaning assigned to it in \nclause (d) of sub-section (1) of section 2 of the Information Technology Act, 2000 (21 of 2000).] \n465. Punishment for forgery.—Whoever commits forgery shall be punished with imprisonment of either description for a term which may \nextend to two years, or with fine, or with both. \n466. Forgery of record of Court or of public registe r, etc.—3[Whoever forges a document or an electronic record], p urporting to be a \nrecord or proceeding of or in a Court of Justice, or a register of birth, baptism, marriage or burial, or a register kept by a public servant as such, or \na certificate or document purporting to be made by a public servant in his official capacity, or an authority to institute or defend a suit, or to take \nany proceedings therein, or to confess judgment, or a p ower of attorney, shall be punished with imprisonment o f either description for a term \nwhich may extend to seven years, and shall also be liable to fine. \n1[Explanation.—For the purposes of this section, “register” includes any list, data or record of any entries maintained in the electronic form \nas defined in clause (r) of sub­section (1) of section 2 of the Information Technology Act, 2000 (21 of 2000).] \n467. Forgery of valuable security, will, etc .—Whoever forges a document which purports to be a valuable \nsecurity or a will, or an authority to adopt a son, or which purports to  give authority to any person to make or transfer any \nvaluable security, or to receive the principal, interest or dividends thereo n, or to receive or deliver any money, movable property, \nor valuable security, or any document purporting to be an acquit tance or receipt acknowledging the payment of money, or an \nacquittance or receipt for the delivery of any movable property or v aluable security, shall be punished with 4[imprisonment for \nlife], or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine. \n                                                           \n1. Ins. by Act 21 of 2000, s. 91 and the First Sch. (w.e.f. 17-10-2000).  \n2. Subs. by Act 10 of 2009, s. 51, for “digital signature” (w.e.f. 27-10-2009). \n3. Subs. by Act 21 of 2000, s. 91 and the First Sch., for certain words (w.e.f. 17-10-2000). \n4. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n110 \n \n468. Forgery for purpose of cheating .—Whoever commits forgery, intending that the 1[document or \nelectronic record forged] shall be used for the purpose of cheating , shall be punished with imprisonment of either \ndescription for a term which may extend to seven years, and shall also be liable to fine. \n469. Forgery for purpose of harming reputation .—Whoever commits forgery, 2[intending that the document \nor electronic record forged] shall harm the reputation of any party, o r knowing that it is likely to be used for that \npurpose, shall be punished with imprisonment of either description f or a term which may extend to three years, an d \nshall also be liable to fine. \n470. Forged document .—A false 3[document or electronic record] made wholly or in part by forgery is \ndesignated “a forged 3[document or electronic record]”. \n471. Using as genuine a forged document or electronic record .—Whoever fraudulently or dishonestly uses \nas genuine any 3[document or electronic record] which he knows or has reason to believe to be a forged 3[document \nor electronic record], shall be punished in the same manner as if he had f orged such 3[document or electronic \nrecord]. \n472. Making or possessing counterfeit seal, etc., with intent to commit fo rgery punishable under section \n467.—Whoever makes or counterfeits any seal, plate or other instrument for making an impression, intending that \nthe same shall be used for the purpose of committing any forgery which would be punishable under section 467 of \nthis Code, or, with such intent, has in his possession any such seal, plate or other instrument, knowing the same to be \ncounterfeit, shall be punished with 4[imprisonment for life], or with imprisonment of either description f or a term \nwhich may extend to seven years, and shall also be liable to fine. \n473. Making or possessing counterfeit seal, etc., with intent to commit forger y punishable otherwise. —\nWhoever makes or counterfeits any seal, plate or other instrument fo r making an impression, intending that the same \nshall be used for the purpose of committing any forgery which would be punishable under any section of this \nChapter other than section 467, or, with such intent, has in his pos session any such seal, plate or other instrument, \nknowing the same to be counterfeit, shall be punished with impriso nment of either description for a term which may \nextend to seven years, and shall also be liable to fine. \n474. Having possession of document described in section 466 or 467, knowing it to be forged and \nintending to use it genuine .—5[Whoever has in his possession any document or electronic record, \nknowing the same to be forged and intending that the same shall fraudulently  or dishonestly be used as \ngenuine, shall, if the document or electronic record is one of the description m entioned in section 466 of \nthis Code], be punished with imprisonment of either description for a term which ma y extend to seven \nyears, and shall also be liable to fine; and if the document is one of the descript ion mentioned in secti on \n467, shall be punished with 4[imprisonment for life], or with imprisonment of either description, for a \nterm which may extend to seven years, and shall also be liable to fine. \n475. Counterfeiting device or mark used for authenticating documents described in section 467, \nor possessing counterfeit marked material .—Whoever counterfeits upon, or in the substance of, any \nmaterial, any device or mark used for the purpose of authenticating any document descri bed in section \n467 of this Code, intending that such device or mark shall be used for the purpose  of giving the \nappearance of authenticity to any document then forged or thereafter to be forged on suc h material, or \nwho, with such intent, has in his possession any material upon or in the substance of whi ch any such \ndevice or mark has been counterfeited, shall be punished with 4[imprisonment for life], or with \nimprisonment of either description for a term which may extend to seven years, and shall also be liable to \nfine. \n476. Counterfeiting device or mark used for authenticating documents other than those \ndescribed in section 467, or possessing counterfeit marked material .—Whoever counterfeits upon, or \nin the substance of, any material, any device or mark used for the purpose of au thenticating 6[any \ndocument or electronic record] other than the documents described in section 467 of this Code, intending \nthat such device or mark shall be used for the purpose of giving the appearan ce of authenticity to any \ndocument then forged or thereafter to be forged on such material, or who with such intent , has in his \npossession any material upon or in the substance of which any such device or mark has  been \ncounterfeited, shall be punished with imprisonment of either description for a term whi ch may extend to \nseven years, and shall also be liable to fine. \n                                                           \n1. Subs. by Act 21 of 2000, s. 91 and the First Sch., “document forget” (w.e.f. 17-10-2000). \n2. Subs. by s. 91, and the First Sch., ibid., “intending that the document forged” (w.e.f. 17-10-2000).  \n3. Subs. by Act 21 of 2000, s. 91 and the First Sch., for “document” (w.e.f. 17-10-2000). \n5. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n4. Subs. by Act 21 of 2000, s. 91 and the First Sch., for certain words (w.e.f. 17-10-2000). \n6. Subs. by Act 21 of 2000, s. 91 and the First Sch., for “any document” (w.e.f. 17-10-2000). \n111 \n \n477. Fraudulent cancellation, destruction, etc., of will, authority to adopt, or valuable \nsecurity.—Whoever fraudulently or dishonestly, or with intent to cause damage or injury t o the public or \nto any person, cancels, destroys or defaces, or attempts to cancel, destroy or deface, or  secretes or \nattempts to secrete any document which is or purports to be a will, or an authority  to adopt a son, or any \nvaluable security, or commits mischief in respect of such document, shall be punished  with \n1[imprisonment for life], or with imprisonment of either description for a term which may extend to seven \nyears, and shall also be liable to fine. \n2[477A. Falsification of accounts .—Whoever, being a clerk, officer or servant, or employed or \nacting in the capacity of a clerk, officer or servant, wilfully, and wit h intent to defraud, destroys, alters, \nmutilates or falsifies any 3[book, electronic record, paper, writing] valuable security or account which \nbelongs to or is in the possession of his employer, or has been received by him for or on behalf of his \nemployer, or wilfully, and with intent to defraud, makes or abets the making of any false entry in, or \nomits or alters or abets the omission or alteration of any material parti cular from or in. any such 5[book, \nelectronic record, paper, writing] valuable security or account, shall be punishe d with imprisonment of \neither description for a term which may extend to seven years, or with fine, or with both. \nExplanation.—It shall be sufficient in any charge under this section to allege a general  intent to \ndefraud without naming any particular person intended to be defrauded or specifying any partic ular sum \nof money intended to be the subject of the fraud, or any particular day on which the  offence was \ncommitted.]  \n4[Of  5*** property and other marks \n478. [Trade Mark.] Rep. by the Trade and Merchandise Marks Act , 1958 (43 of 1958),s. 135 andSch. \n(w. e. f. 25-11-1959). \n479. Property mark .—A mark used for denoting that movable property belongs to a particular \nperson is called a property mark. \n480. [Using a false trade mark .] Rep. by the Trade and Merchandise Marks Act , 1958 (43 of 1958),           \ns. 135 and Sch. (w.e.f. 25- 11-1959). \n481. Using a false property mark .—Whoever marks any movable property or goods or any case, \npackage or other receptacle containing movable property or goods, or uses any ca se, package or other \nreceptacle having any mark thereon, in a manner reasonably calculated to cause it to be be lieved that the \nproperty or goods so marked, or any property or goods contained in any such receptacle so marked, \nbelong to a person to whom they do not belong, is said to use a false property mark. \n482. Punishment for using a false property mark .—Whoever uses 6*** any false property mark \nshall, unless he proves that he acted without intent to defraud, be punished wit h imprisonment of either \ndescription for a term which may extend to one year, or with fine, or with both. \n483. Counterfeiting a property mark used by another .—Whoever counterfeits any 7*** property \nmark used by any other person shall be punished with imprisonment of either description for a term which \nmay extend to two years, or with fine, or with both. \n484. Counterfeiting a mark used by a public servant .—Whoever counterfeits any property mark \nused by a public servant, or any mark used by a public servant to denote that any propert y has been \nmanufactured by a particular person or at a particular time or place, or that th e property is of a particular \nquality or has passed through a particular office, or that it is entitl ed to any exemption, or uses as genuine \nany such mark knowing the same to be counterfeit, shall be punished with imprisonment of eit her \ndescription for a term which may extend to three years, and shall also be liable to fine. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. Ins. by Act 3 of 1895, s. 4. \n3. Subs. by Act 21 of 2000, s. 91 and the First Sch., for “book, paper, writing” (w.e.f. 17-10-2000). \n4. Subs. by Act 4 of 1889, s. 3, for the original heading and ss. 478 to 489. \n5. The word “Trade” omitted by Act 43 of 1958, s. 135 and the Sch. (w.e.f. 25-11-1959). \n6. The words “any false trade mark or” omitted by s. 135 and the Sch., ibid. (w.e.f. 25-11-1959). \n7. The words “trade mark or” omitted by s. 135 and the Sch., ibid. (w.e.f. 25-11-1959). \n112 \n \n1[485. Making or possession of any instrument for counterfeiting a property mark .—Whoever \nmakes or has in his possession any die, plate or other instrument for the purpose of  counterfeiting a \nproperty mark, or has in his possession a property mark for the purpose of denoting that any goods belong \nto a person to whom they do not belong, shall be punished with imprisonment of either d escription for a \nterm which may extend to three years, or with fine, or with both.] \n486. Selling goods marked with a counterfeit property mark.—2[Whoever sells, or exposes, or has \nin possession for sale, any goods or things with a counterfeit property mark] affixed to or impressed upon \nthe same or to or upon any case, package or other receptacle in which such goods are c ontained, shall, \nunless he proves \n(a) that, having taken all reasonable precautions against committing an offence against  this \nsection, he had at the time of the commission of the alleged offence no reason to suspect the  \ngenuineness of the mark, and \n(b) that, on demand made by or on behalf of the prosecutor, he gave all the information in his \npower with respect to the persons from whom he obtained such goods or things, or \n(c) that otherwise he had acted innocently, \nbe punished with imprisonment of either description for a term which may exte nd to one year, or with \nfine, or with both. \n487. Making a false mark upon any receptacle containing goods .—Whoever makes any false \nmark upon any case, package or other receptacle containing goods, in a manner reasonably cal culated to \ncause any public servant or any other person to believe that such receptacle contains goods which it does \nnot contain or that it does not contain goods which it does contain, or that the goods contained in such \nreceptacle are of a nature or quality different from the real nature or  quality thereof, shall, unless he \nproves that he acted without intent to defraud, be punished with imprisonment of either description for a \nterm which may extend to three years, or with fine, or with both. \n488. Punishment for making use of any such false mark .—Whoever makes use of any such false \nmark in any manner prohibited by the last foregoing section shall, unless he prov es that he acted without \nintent to defraud, be punished as if he had committed an offence against that section. \n489. Tampering with property mark with intent to cause injury .—Whoever removes, destroys, \ndefaces or adds to any property mark, intending or knowing it to be likely that he may thereby cause \ninjury to any person, shall be punished with imprisonment of either descripti on for a term which may \nextend to one year, or with fine, or with both.] \n3[Of currency-notes and bank-notes \n489A. Counterfeiting currency-notes or bank-notes .—Whoever counterfeits, or knowingly \nperforms any part of the process of counterfeiting, any currency-note or bank-note, shall be punished with \n4[imprisonment for life], or with imprisonment of either description for a term which may extend to ten \nyears, and shall also be liable to fine. \nExplanation.—For the purposes of this section and of sections 489B, 5[489C, 489D and 489E], the \nexpression “bank-note” means a promissory note or engagement for the payment of money to bearer on  \ndemand issued by any person carrying on the business of banking in any part of the world, or issued by or \nunder the authority of any State or Sovereign Power, and intended to be used as equivalent to, or as a \nsubstitute for money. \n489B. Using as genuine, forged or counterfeit currency-notes or bank-notes .—Whoever sells to, \nor buys or receives from, any other person, or otherwise traffics in or uses as  genuine, any forged or \ncounterfeit currency-note or bank-note, knowing or having reason to believe the same t o be forged or \ncounterfeit, shall be punished with 4[imprisonment for life], or with imprisonment of either description for \na term which may extend to ten years, and shall also be liable to fine.  \n                                                           \n1. Subs. by Act 43 of 1958, s. 135 and the Sch., for s. 485 (w.e.f. 25-11-1959). \n2. Subs. by s. 135 and the Sch., ibid., for certain words (w.e.f. 25-11-1959). \n3. Added by Act 12 of 1899, s. 2. \n4. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n5. Subs. by Act 35 of 1950, s. 3 and the Second Sch., for “489C and 489D”. \n113 \n \n489C. Possession of forged or counterfeit currency-notes or bank-notes .—Whoever has in his \npossession any forged or counterfeit currency-note or bank-note, knowing or having reason to be lieve the \nsame to be forged or counterfeit and intending to use the same as genuine or that it ma y be used as \ngenuine, shall be punished with imprisonment of either description for a term which may extend to seven \nyears, or with fine, or with both. \n489D. Making or possessing instruments or materials for forging or counterfeiting currency \nnotes or bank-notes.—Whoever makes, or performs any part of the process of making, or buys or sells  \nor disposes of, or has in his possession, any machinery, instrument or material f or the purpose of being \nused, or knowing or having reason to believe that it is intended to be used, for forgi ng or counterfeiting \nany currency-note or bank-note, shall be punished with 1[imprisonment for life], or with imprisonment of \neither description for a term which may extend to ten years, and shall also be liable to fine.] \n2[489E. Making or using documents resembling currency-notes or bank-notes .—(1) Whoever \nmakes, or causes to be made, or uses for any purpose whatsoever, or delivers to any person, any document \npurporting to be, or in any way resembling, or so nearly resembling as to be calcul ated to deceive, any \ncurrency-note or bank-note shall be punished with fine which may extend to one hundred rupees. \n(2) If any person, whose name appears on a document the making of which is an offence under  \nsub-section (1), refuses, without lawful excuse, to disclose to a police-officer on being so requi red the \nname and address of the person by whom it was printed or otherwise made, he shall be punished with fine \nwhich may extend to two hundred rupees. \n(3) Where the name of any person appears on any document in respect of which any person is \ncharged with an offence under sub-section (1) or on any other document used or distributed in connection \nwith that document it may, until the contrary is proved, be presumed that that person caused the document \nto be made.] \nCHAPTER XIX \nOFTHE CRIMINAL BREACHOF CONTRACTSOF SERVICE \n490. [ Breach of contract of service during voyage or journey .] Rep. by the Workmen's Breach of \nContract (Repealing) Act, 1925 (3 of 1925), s. 2 and Sch. \n491. Breach of contract to attend on and supply wants of helpless person .—Whoever, being \nbound by a lawful contract to attend on or to supply the wants of any person who, by reason of youth, o r \nof unsoundness of mind, or of a disease or bodily weakness, is helpless or incapable of pr oviding for his \nown safety or of supplying his own wants, voluntarily omits so to do, shall be punished w ith \nimprisonment of either description for a term which may extend to three months, or with fine which may \nextend to two hundred rupees, or with both. \n492. [Breach of contract to serve at distant place to which servant is conveyed at master's exp ense.] \nRep. by the Workmen's Breach of Contract (Repealing) Act,1925 (3 of 1925), s. 2 and Sch. \nCHAPTER XX \nOF OFFENCES RELATING TO MARRIAGE \n493. Cohabitation caused by a man deceitfully inducing a belief of lawful marriage.—Every man \nwho by deceit causes any woman who is not lawfully married to him to believe that she is lawfully \nmarried to him and to cohabit or have sexual intercourse with him in that bel ief, shall be punished with \nimprisonment of either description for a term which may extend to ten years, and s hall also be liable to \nfine. \n494. Marrying again during lifetime of husband or wife .—Whoever, having a husband or wife \nliving, marries in any case in which such marriage is void by reason of its taking  place during the life of \nsuch husband or wife, shall be punished with imprisonment of either description f or a term which may \nextend to seven years, and shall also be liable to fine. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. Ins. by Act 6 of 1943, s. 2. \n114 \n \nException.—This section does not extend to any person whose marriage with such husband or wife \nhas been declared void by a Court of competent jurisdiction, \nnor to any person who contracts a marriage during the life of a former husband or  wife, if such \nhusband or wife, at the time of the subsequent marriage, shall have been continually absent from such \nperson for the space of seven years, and shall not have been heard of by such person as being ali ve within \nthat time provided the person contracting such subsequent marriage shall, before such marri age takes \nplace, inform the person with whom such marriage is contracted of the real state of f acts so far as the \nsame are within his or her knowledge. \n495. Same offence with concealment of former marriage from person with whom subsequen t \nmarriage is contracted. —Whoever commits the offence defined in the last preceding section having \nconcealed from the person with whom the subsequent marriage is contracted, the fact  of the former \nmarriage, shall be punished with imprisonment of either description for a term which may extend to ten \nyears, and shall also be liable to fine. \n496. Marriage ceremony fraudulently gone through without lawful marriage .—Whoever, \ndishonestly or with a fraudulent intention, goes through the ceremony of being marri ed, knowing that he \nis not thereby lawfully married, shall be punished with imprisonment of e ither description for a term \nwhich may extend to seven years, and shall also be liable to fine. \n497. Adultery.—Whoever has sexual intercourse with a person who is and whom he knows or has \nreason to believe to be the wife of another man, without the consent or connivance  of that man, such \nsexual intercourse not amounting to the offence of rape, is guilty of the offe nce of adultery, and shall be \npunished with imprisonment of either description for a term which may extend to f ive years, or with fine, \nor with both. In such case the wife shall not be punishable as an abettor. \n498. Enticing or taking away or detaining with criminal intent a married woman .—Whoever \ntakes or entices away any woman who is and whom he knows or has reason to believe to be the wife of \nany other man, from that man, or from any person having the care of her on behalf of that m an, with \nintent that she may have illicit intercourse with any person, or conceals or detai ns with that intent any \nsuch woman, shall be punished with imprisonment of either description for a term which may extend to \ntwo years, or with fine, or with both. \n1[CHAPTER XXA \nOFCRUELTY BY HUSBANDOR RELATIVESOF HUSBAND \n498A. Husband or relative of husband of a woman subjecting her to cruelty .—Whoever, being \nthe husband or the relative of the husband of a woman, subjects such woman to cruelty  shall be punished \nwith imprisonment for a term which may extend to three years and shall also be liable to fine. \nExplanation.—For the purposes of this section, “cruelty” means— \n(a) any wilful conduct which is of such a nature as is likely to drive the woman to commit suicide \nor to cause grave injury or danger to life, limb or health (whether mental or physi cal) of the woman; \nor \n(b) harassment of the woman where such harassment is with a view to coercing her or  any person \nrelated to her to meet any unlawful demand for any property or valuable security  or is on account of \nfailure by her or any person related to her to meet such demand.] \nCHAPTER XXI \nOF DEFAMATION \n499. Defamation.—Whoever, by words either spoken or intended to be read, or by signs or by visible \nrepresentations, makes or publishes any imputation concerning any person intending to harm, or knowing \nor having reason to believe that such imputation will harm, the reputation of such per son, is said, except \nin the cases hereinafter excepted, to defame that person. \n                                                           \n1. Ins. by Act 46 of 1983, s. 2 (w.e.f. 25-12-1983). \n115 \n \nExplanation 1.—It may amount to defamation to impute anything to a deceased person, if the \nimputation would harm the reputation of that person if living, and is intended to be hurt ful to the fellings \nof his family or other near relatives. \nExplanation 2.—It may amount to defamation to make an imputation concerning a company or an \nassociation or collection of persons as such. \nExplanation 3.—An imputation in the form of an alternative or expressed ironically, may am ount to \ndefamation. \nExplanation 4.—No imputation is said to harm a person's reputation, unless that imputation directly  \nor indirectly, in the estimation of others, lowers the moral or intellectual  character of that person, or \nlowers the character of that person in respect of his caste or of his calling, or  lowers the credit of that \nperson, or causes it to be believed that the body of that person is in a loothsome stat e, or in a state \ngenerally considered as disgraceful. \nIllustrations \n(a) A says— “Z is an honest man; he never stole B's watch ”; intending to cause it to be believed that Z did steal B's watch. \nThis is defamation, unless it fall within one of the exceptions. \n(b) A is asked who stole B's watch. A points to Z, intending to cause it to  be believed that Z stole B's watch. This is \ndefamation, unless it fall within one of the exceptions. \n(c) A draws a picture of Z running away with B's watch, intending it to be  believed that Z stole B's watch. This is \ndefamation, unless it fall within one of the exceptions. \nFirst Exception.—Imputation of truth which public good requires to be made or published .—It \nis not defamation to impute anything which is true concerning any person, if it be for the public good that \nthe imputation should be made or published. Whether or not it is for the public good is a question of fact. \nSecond Exception .—Public conduct of public servants .—It is not defamation to express in good \nfaith any opinion whatever respecting the conduct of a public servant in the discharg e of his public \nfunctions, or respecting his character, so far as his character appears in that conduct, and no further. \nThird Exception.—Conduct of any person touching any public question .—It is not defamation to \nexpress in good faith any opinion whatever respecting the conduct of any person touching  any public \nquestion, and respecting his character, so far as his character appears in that conduct, and no further. \nIllustration \nIt is not defamation in A to express in good faith any opinion w hatever respecting Z's conduct in petitioning Government on \na public question, in signing a requisition for a meeting on a p ublic question, in presiding or attending at such meeting, in \nforming or joining any society which invites the public support, in  voting or canvassing for a particular candidate for any \nsituation in the efficient discharge of the duties of which the public is interested. \nFourth Exception .—Publication of reports of proceedings of courts. —It is not defamation to \npublish substantially true report of the proceedings of a Court of Justice, or of  the result of any such \nproceedings. \nExplanation.—A Justice of the Peace or other officer holding an enquiry in open Court preliminary to \na trial in a Court of Justice, is a Court within the meaning of the above section. \nFifth Exception .—Merits of case decided in Court or conduct of witnesses and others \nconcerned.—It is not defamation to express in good faith any opinion whatever respecting the merits of \nany case, civil or criminal, which has been decided by a Court of Justice, or respecting the conduct of any \nperson as a party, witness or agent, in any such case, or respecting the characte r of such person, as far as \nhis character appears in that conduct, and no further. \n  Illustrations \n(a) A says —“I think Z's evidence on that trial is so contradictory that he must be stupid  or dishonest. ” A is within this \nexception if he says this in good faith, inasmuch as the opinion which he expresses respects Z's character as it appears in Z's \nconduct as a witness, and no farther. \n(b) But if A says—“I do not believe what Z asserted at that trial because I know him to be a man without veracity”; A is not \nwithin this exception, inasmuch as the opinion which express of Z's character, is an opinion not founded on Z's conduct as a \nwitness. \nSixth Exception.—Merits of public performance.—It is not defamation to express in good faith any \nopinion respecting the merits of any performance which its author has submitted to the j udgment of the \n116 \n \npublic, or respecting the character of the author so far as his character app ears in such performance, and \nno further. \nExplanation.—A performance may be submitted to the judgment of the public expressly or by acts on \nthe part of the author which imply such submission to the judgment of the public. \nIllustrations \n(a) A person who publishes a book, submits that book to the judgment of the public. \n(b) A person who makes a speech in public, submits that speech to the judgment of the public. \n(c) An actor or singer who appears on a public stage, submits his acting or singing to the judgment of the public. \n(d) A says of a book published by Z —“Z’s book is foolish; Z must be a weak man. Z's book is indecent; Z mu st be a man \nof impure mind ”. A is within the exception, if he says this in good faith, inasm uch as the opinion which he expresses of Z \nrespects Z's character only so far as it appears in Z's book, and no further. \n(e) But if A says “I am not surprised that Z's book is foolish and indecent, for he is a weak man and a libertine ”. A is not \nwithin this exception, in as much as the opinion which he expresses of Z's character is an opinion not founded on Z's book. \nSeventh Exception .—Censure passed in good faith by person having lawful authority over \nanother.—It is not defamation in a person having over another any authority, either conferr ed by law or \narising out of a lawful contract made with that other, to pass in good faith any censure on the conduct of \nthat other in matters to which such lawful authority relates. \nIllustration \nA Judge censuring in good faith the conduct of a witness, or o f an officer of the Court; a head of a department censuring in \ngood faith those who are under his orders, a parent censuring in goo d faith a child in the presence of other children; a \nschoolmaster, whose authority is derived from a parent, censuring in g ood faith a pupil in the presence of other pupils; a master \ncensuring a servant in good faith for remissness in service; a banker ce nsuring in good faith the cashier of his bank for the \nconduct of such cashier as such cashier- are within this exception. \nEighth Exception .—Accusation preferred in good faith to authorised person .—It is not \ndefamation to prefer in good faith an accusation against any person to any of those who have lawful \nauthority over that person with respect to the subject-matter of accusation. \nIllustration \nIf A in good faith accuses Z before a Magistrate; if A in good faith complains of the conduct of Z, a servant, to Z's master; if \nA in good faith complains of the conduct of Z, a child, to Z's father-A is within this exception. \nNinth Exception .—Imputation made in good faith by person for protection of his or other's \ninterests.—It is not defamation to make an imputation on the character of another provided that  the \nimputation be made in good faith for the protection of the interest s of the person making it, or of any \nother person, or for the public good. \nIllustrations \n(a) A, a shopkeeper, says to B, who manages his business —“Sell nothing to Z unless he pays you ready money, for I have \nno opinion of his honesty. ” A is within the exception, if he has made this imputation on Z in go od faith for the protection of his \nown interests. \n(b) A, a Magistrate, in making a report to his own superior officer, casts a n imputation on the character of Z. Here, if the \nimputation is made in good faith, and for the public good, A is within the exception. \nTenth Exception.—Caution intended for good of person to whom conveyed or for public good .—\nIt is not defamation to convey a caution, in good faith, to one person against another , provided that such \ncaution be intended for the good of the person to whom it is conveyed, or of some person i n whom that \nperson is interested, or for the public good. \n500. Punishment for defamation .—Whoever defames another shall be punished with simple \nimprisonment for a term which may extend to two years, or with fine, or with both. \n501. Printing or engraving matter known to be defamatory .—Whoever prints or engraves any \nmatter, knowing or having good reason to believe that such matter is defamatory of any per son, shall be \npunished with simple imprisonment for a term which may extend to two years, or with fine, or with both. \n502. Sale of printed or engraved substance containing defamatory matter .—Whoever sells or \noffers for sale any printed or engraved substance containing defamatory matter , knowing that it contains \n117 \n \nsuch matter, shall be punished with simple imprisonment for a term which may  extend to two years, or \nwith fine, or with both. \nCHAPTER XXII \nOF CRIMINAL INTIMIDATION, INSULT AND ANNOYANCE \n503. Criminal intimidation.—Whoever threatens another with any injury to his person, reputation or \nproperty, or to the person or reputation of any one in whom that person is int erested, with intent to cause \nalarm to that person, or to cause that person to do any act which he is not legal ly bound to do, or to omit \nto do any act which that person is legally entitled to do, as the means of avoiding the execution of such \nthreat, commits criminal intimidation. \nExplanation.—A threat to injure the reputation of any deceased person in whom the person threatened \nis interested, is within this section. \nIllustration \nA, for the purpose of inducing B to resist from prosecuting a civil su it, threatens to burn B's house. A is guilty of criminal \nintimidation. \n504. Intentional insult with intent to provoke breach of the peace .—Whoever intentionally \ninsults, and thereby gives provocation to any person, intending or knowing it to be li kely that such \nprovocation will cause him to break the public peace, or to commit any other of fence, shall be punished \nwith imprisonment of either description for a term which may extend to two yea rs, or with fine, or with \nboth. \n1[505. Statements conducing to public mischief .—2[(1)] Whoever makes, publishes or circulates \nany statement, rumour or report,— \n(a) with intent to cause, or which is likely to cause, any officer, soldier, 3[sailor or airman] in the \nArmy, 4[Navy or Air Force] 5[of India] to mutiny or otherwise disregard or fail in his duty as such; or  \n(b) with intent to cause, or which is likely to cause, fear or alarm to the public, or to any section \nof the public whereby any person may be induced to commit an offence against the St ate or against \nthe public tranquility; or \n(c) with intent to incite, or which is likely to incite, any class or community of persons to commit \nany offence against any other class or community, \nshall be punished with imprisonment which may extend to 6[three years], or with fine, or with both. \n7[(2) Statements creating or promoting enmity, hatred or ill-will between classes .—Whoever \nmakes, publishes or circulates any statement or report containing rumour or alar ming news with intent to \ncreate or promote, or which is likely to create or promote, on grounds of relig ion, race, place of birth, \nresidence, language, caste or community or any other ground whatsoever, feelings of enmit y, hatred or  \nill-will between different religious, racial, language or regional g roups or castes or communities, shall be \npunished with imprisonment which may extend to three years, or with fine, or with both. \n(3) Offence under sub-section ( 2) committed in place of worship, etc .—Whoever commits an \noffence specified in sub-section ( 2) in any place of worship or in any assembly engaged in the \nperformance of religious worship or religious ceremonies, shall be punished with im prisonment which \nmay extend to five years and shall also be liable to fine.] \nException.—It does not amount to an offence, within the meaning of this section, when th e person \nmaking, publishing or circulating any such statement, rumour or report, has reasonable grounds for \n                                                           \n1. Subs. by Act 4 of 1898, s. 6, for s. 505. \n2. Section 505 re-numbered as sub-section (1) of that section by Act 35 of 1969, s. 3 (w.e.f. 4-9-1969). \n3. Subs. by Act 10 of 1927, s. 2 and the First Sch., for “or sailor”. \n4. Subs. by s. 2 and the First Sch., ibid., for “or Navy”. \n5. Subs. by the A. O. 1950, for “of Her Majesty or in the Imperial S ervice Troops” The words “or in the Royal Indian Marine” \noccurring after the word “Majesty” omitted by Act 35 of 1934, s. 2 and Sch. \n6. Subs. by Act 41 of 1961, s. 4, for “two years” (w.e.f. 12-9-1961). \n7. Ins. by Act 35 of 1969, s. 3 (w.e.f. 4-9-1969). \n118 \n \nbelieving that such statement, rumour or report is true and makes, publishes or circulates it 2[in good faith \nand] without any such intent as aforesaid.] \n506. Punishment for criminal intimidation .—Whoever commits the offence of criminal \nintimidation shall be punished with imprisonment of either description for a ter m which may extend to \ntwo years, or with fine, or with both; \nIf threat be to cause death or grievous hurt, etc .—and if the threat be to cause death or grievous \nhurt, or to cause the destruction of any property by fire, or to cause an offence puni shable with death or \n1[imprisonment for life], or with imprisonment for a term which may extend to seven years, or to impute \nunchastity to a woman, shall be punished with imprisonment of either description for a term which may \nextend to seven years, or with fine, or with both. \n507. Criminal intimidation by an anonymous communication .—Whoever commits the offence of \ncriminal intimidation by an anonymous communication, or having taken precaution to conceal the name \nor abode of the person from whom the threat comes, shall be punished with imprisonment of either \ndescription for a term which may extend to two years, in addition to the punis hment provided for the \noffence by the last preceding section. \n508. Act caused by inducing person to believe that he will be rendered an object of the D ivine \ndispleasure.—Whoever voluntarily causes or attempts to cause any person to do anything which that \nperson is not legally bound to do, or to omit to do anything which he is legally entitled to do, by inducing \nor attempting to induce that person to believe that he or any person in whom he is interested will become \nor will be rendered by some act of the offender an object of Divine displeasure if he does not do the thing \nwhich it is the object of the offender to cause him to do, or if he does the thing which it is the object of the \noffender to cause him to omit, shall be punished with imprisonment of either description for a term which \nmay extend to one year, or with fine, or with both. \nIllustrations \n(a) A sits dhurna at Z's door with the intention of causing it to be beli eved that, by so sitting, he renders Z an object of \nDivine displeasure. A has committed the offence defined in this section. \n(b) A threatens Z that, unless Z performs a certain act, A will kill one of A's own children, under such circumstances that the \nkilling would be believed to render Z an object of Divine displeasure. A has committed the offence defined in this section. \n509. Word, gesture or act intended to insult the modesty of a woman .—Whoever, intending to \ninsult the modesty of any woman, utters any words, makes any sound or gesture, or exhi bits any object, \nintending that such word or sound shall be heard, or that such gesture or object shall  be seen, by such \nwoman, or intrudes upon the privacy of such woman, 2[shall be punished with simple imprisonment for a \nterm which may extend to three years, and also with fine]. \nSTATE AMENDMENT \nChhattisgarh  \nAfter Section 509 of the Penal Code, the following shall be inserted, namely: — \n509A. Sexual harassment by relative. —Whoever, being related to a woman through blood, \nadoption or marriage, and not being her husband, takes the advantage of his proximity and induces , \nseduces or threatens such woman with intent to insult her modesty by word, gestur e or act shall be \npunished with rigorous imprisonment which shall not be less than one year but which may extend to five \nyears and shall also liable to fine. \n509B. Sexual harassment by electronic mode. —Whoever, by means of telecommunication device \nor by any other electronic mode including internet, makes creates, solicits or init iates the transmission of \nany comment, request, suggestion, proposal, image or other communication, which is obscene, l ewd, \nlascivious, filthy or indecent with intent to harass or cause or having k nowledge that it would harass or \ncause annoyance or mental agony to a woman shall be punished with rigorous imprisonment  for a term \nwhich shall not be less than six months but may extend to two years and shall also be liable to fine. \n[Vide Chhattisgarh Act 25 of 2015, sec. 6]. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. Subs. by Act 13 of 2013, s. 10, for “shall be punished with simple imprisonment for a term which may exten d to one year, or \nwith fine, or with both” (w.e.f. 3-2-2013). \n119 \n \n510. Misconduct in public by a drunken person .—Whoever, in a state of intoxication, appears in \nany public place, or in any place which it is a trespass in him to enter, and there conducts him self in such \na manner as to cause annoyance to any person, shall be punished with simple imprisonment for a term \nwhich may extend to twenty-four hours, or with fine which may extend to ten rupees, or with both. \nCHAPTER XXIII \nOF ATTEMPTS TO COMMIT OFFENCES \n511. Punishment for attempting to commit offences punishable with imprisonment for life or \nother imprisonment .—Whoever attempts to commit an offence punishable by this Code with \n1[imprisonment for life] or imprisonment, or to cause such an offence to be c ommitted, and in such \nattempt does any act towards the commission of the offence, shall, where no express provision is made by \nthis Code for the punishment of such attempt, be punished with 2[imprisonment of any description \nprovided for the offence, for a term which may extend to one-half of the imprisonm ent for life or, as the \ncase may be, one-half of the longest term of imprisonment provided for that offence], or with such fine as \nis provided for the offence, or with both. \nIllustrations \n(a) A makes an attempt to steal some jewels by breaking open a box , and finds after so opening the box, that there is no \njewel in it. He has done an act towards the commission of theft, and therefore is guilty under this section. \n(b) A makes an attempt to pick the pocket of Z by thrusting his hand into Z's pocket. A fails in the attempt in consequence of \nZ's having nothing in his pocket. A is guilty under this section. \n                                                           \n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956). \n2. Subs. by s. 117 and the Sch., ibid., for certain words (w.e.f. 1-1-1956)."
  }
]